function [ Ass2 ] = fujinshuchu200( Asmax,Astong )
%此子函数用于负筋在所有数组里面选值
%间距200
%采用穷举法，将所有配筋形式全部建立数组。 
AA08=[12   200  0   0    565;
      12   200  12  400  848;
      12   200  14  400  950;
      12   200  16  400  1068;
      12   200  12  200  1130;
      12   200  14  200  1335;
      12   200  16  200  1570];
  
AA09=[14   200  0   0    770;
      14   200  12  400  1053;
      14   200  14  400  1155;
      14   200  16  400  1273;
      14   200  12  200  1335;
      14   200  18  400  1406;
      14   200  14  200  1540;
      14   200  16  200  1775;
      14   200  18  200  2042];
  
AA10=[16   200  0   0    1005;
      16   200  12  400  1288;
      16   200  14  400  1390;
      16   200  16  400  1508;
      16   200  12  200  1570;
      16   200  18  400  1641;
      16   200  14  200  1775;
      16   200  20  400  1790;
      16   200  16  200  2010;
      16   200  18  200  2277;
      16   200  20  200  2576]; 

AA11=[18   200  0   0    1272;
      18   200  14  400  1657;
      18   200  16  400  1775;
      18   200  18  400  1908;
      18   200  14  200  2042;
      18   200  20  400  2057;
      18   200  22  400  2222;
      18   200  16  200  2277;
      18   200  18  200  2544;
      18   200  20  200  2843;
      18   200  22  200  3173];
 
AA12=[20   200  0   0    1571;
      20   200  16  400  2074;
      20   200  18  400  2207;
      20   200  20  400  2356;
      20   200  22  400  2521;
      20   200  16  200  2576;
      20   200  25  400  2798;
      20   200  18  200  2843;
      20   200  20  200  3142;
      20   200  22  200  3472;
      20   200  25  200  4025];
  
AA13=[22   200  0   0    1901;
      22   200  18  400  2537;
      22   200  20  400  2686;
      22   200  22  400  2851;
      22   200  25  400  3128;
      22   200  18  200  3173;
      22   200  20  200  3472;
      22   200  22  200  3802;
      22   200  25  200  4355];
  
AA14=[25   200  0   0    2454;
      25   200  20  400  3239;
      25   200  22  400  3404;
      25   200  25  400  3681;
      25   200  20  200  4025;
      25   200  22  200  4355;
      25   200  25  200  4908];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%以上为间距200档 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%间距200档选筋 
    if Astong<=AA08(1,5) && Asmax<=AA08(7,5)    %确定是否选择数组AA08
       if Asmax<=AA08(2,5)                      
             Ass2=[AA08(2,1) AA08(2,2) AA08(2,3) AA08(2,4) AA08(2,5)];
       elseif Asmax<=AA08(3,5) && Asmax>AA08(2,5)
             Ass2=[AA08(3,1) AA08(3,2) AA08(3,3) AA08(3,4) AA08(3,5)];
       elseif Asmax<=AA08(4,5) && Asmax>AA08(3,5)
             Ass2=[AA08(4,1) AA08(4,2) AA08(4,3) AA08(4,4) AA08(4,5)];
       elseif Asmax<=AA08(5,5) && Asmax>AA08(4,5)
             Ass2=[AA08(5,1) AA08(5,2) AA08(5,3) AA08(5,4) AA08(5,5)];
       elseif Asmax<=AA08(6,5) && Asmax>AA08(5,5)
             Ass2=[AA08(6,1) AA08(6,2) AA08(6,3) AA08(6,4) AA08(6,5)];
       elseif Asmax<=AA08(7,5) && Asmax>AA08(6,5)
             Ass2=[AA08(7,1) AA08(7,2) AA08(7,3) AA08(7,4) AA08(7,5)];
       end
        
    elseif Astong<=AA09(1,5) && Asmax<=AA09(9,5)     %确定是否选择数组AA09
       if Asmax<=AA09(2,5)                      
             Ass2=[AA09(2,1) AA09(2,2) AA09(2,3) AA09(2,4) AA09(2,5)];
       elseif Asmax<=AA09(3,5) && Asmax>AA09(2,5)
             Ass2=[AA09(3,1) AA09(3,2) AA09(3,3) AA09(3,4) AA09(3,5)];
       elseif Asmax<=AA09(4,5) && Asmax>AA09(3,5)
             Ass2=[AA09(4,1) AA09(4,2) AA09(4,3) AA09(4,4) AA09(4,5)];
       elseif Asmax<=AA09(5,5) && Asmax>AA09(4,5)
             Ass2=[AA09(5,1) AA09(5,2) AA09(5,3) AA09(5,4) AA09(5,5)];
       elseif Asmax<=AA09(6,5) && Asmax>AA09(5,5)
             Ass2=[AA09(6,1) AA09(6,2) AA09(6,3) AA09(6,4) AA09(6,5)];
       elseif Asmax<=AA09(7,5) && Asmax>AA09(6,5)
             Ass2=[AA09(7,1) AA09(7,2) AA09(7,3) AA09(7,4) AA09(7,5)];
       elseif Asmax<=AA09(8,5) && Asmax>AA09(7,5)
             Ass2=[AA09(8,1) AA09(8,2) AA09(8,3) AA09(8,4) AA09(8,5)];      
       elseif Asmax<=AA09(9,5) && Asmax>AA09(8,5)
             Ass2=[AA09(9,1) AA09(9,2) AA09(9,3) AA09(9,4) AA09(9,5)];                    
       end  
      
    elseif Astong<=AA10(1,5) && Asmax<=AA10(11,5)    %确定是否选择数组AA10
       if Asmax<=AA10(2,5)                      
             Ass2=[AA10(2,1) AA10(2,2) AA10(2,3) AA10(2,4) AA10(2,5)];
       elseif Asmax<=AA10(3,5) && Asmax>AA10(2,5)
             Ass2=[AA10(3,1) AA10(3,2) AA10(3,3) AA10(3,4) AA10(3,5)];
       elseif Asmax<=AA10(4,5) && Asmax>AA10(3,5)
             Ass2=[AA10(4,1) AA10(4,2) AA10(4,3) AA10(4,4) AA10(4,5)];
       elseif Asmax<=AA10(5,5) && Asmax>AA10(4,5)
             Ass2=[AA10(5,1) AA10(5,2) AA10(5,3) AA10(5,4) AA10(5,5)];
       elseif Asmax<=AA10(6,5) && Asmax>AA10(5,5)
             Ass2=[AA10(6,1) AA10(6,2) AA10(6,3) AA10(6,4) AA10(6,5)];
       elseif Asmax<=AA10(7,5) && Asmax>AA10(6,5)
             Ass2=[AA10(7,1) AA10(7,2) AA10(7,3) AA10(7,4) AA10(7,5)];
       elseif Asmax<=AA10(8,5) && Asmax>AA10(7,5)
             Ass2=[AA10(8,1) AA10(8,2) AA10(8,3) AA10(8,4) AA10(8,5)];      
       elseif Asmax<=AA10(9,5) && Asmax>AA10(8,5)
             Ass2=[AA10(9,1) AA10(9,2) AA10(9,3) AA10(9,4) AA10(9,5)];                    
       elseif Asmax<=AA10(10,5) && Asmax>AA10(9,5)
             Ass2=[AA10(10,1) AA10(10,2) AA10(10,3) AA10(10,4) AA10(10,5)];       
       elseif Asmax<=AA10(11,5) && Asmax>AA10(10,5)
             Ass2=[AA10(11,1) AA10(11,2) AA10(11,3) AA10(11,4) AA10(11,5)];       
       end       
       
    elseif Astong<=AA11(1,5) && Asmax<=AA11(11,5)    %确定是否选择数组AA11
       if Asmax<=AA11(2,5)                      
             Ass2=[AA11(2,1) AA11(2,2) AA11(2,3) AA11(2,4) AA11(2,5)];
       elseif Asmax<=AA11(3,5) && Asmax>AA11(2,5)
             Ass2=[AA11(3,1) AA11(3,2) AA11(3,3) AA11(3,4) AA11(3,5)];
       elseif Asmax<=AA11(4,5) && Asmax>AA11(3,5)
             Ass2=[AA11(4,1) AA11(4,2) AA11(4,3) AA11(4,4) AA11(4,5)];
       elseif Asmax<=AA11(5,5) && Asmax>AA11(4,5)
             Ass2=[AA11(5,1) AA11(5,2) AA11(5,3) AA11(5,4) AA11(5,5)];
       elseif Asmax<=AA11(6,5) && Asmax>AA11(5,5)
             Ass2=[AA11(6,1) AA11(6,2) AA11(6,3) AA11(6,4) AA11(6,5)];
       elseif Asmax<=AA11(7,5) && Asmax>AA11(6,5)
             Ass2=[AA11(7,1) AA11(7,2) AA11(7,3) AA11(7,4) AA11(7,5)];
       elseif Asmax<=AA11(8,5) && Asmax>AA11(7,5)
             Ass2=[AA11(8,1) AA11(8,2) AA11(8,3) AA11(8,4) AA11(8,5)];      
       elseif Asmax<=AA11(9,5) && Asmax>AA11(8,5)
             Ass2=[AA11(9,1) AA11(9,2) AA11(9,3) AA11(9,4) AA11(9,5)];                    
       elseif Asmax<=AA11(10,5) && Asmax>AA11(9,5)
             Ass2=[AA11(10,1) AA11(10,2) AA11(10,3) AA11(10,4) AA11(10,5)];       
       elseif Asmax<=AA11(11,5) && Asmax>AA11(10,5)
             Ass2=[AA11(11,1) AA11(11,2) AA11(11,3) AA11(11,4) AA11(11,5)];       
       end

    elseif Astong<=AA12(1,5) && Asmax<=AA12(11,5)    %确定是否选择数组AA12
       if Asmax<=AA12(2,5)                      
             Ass2=[AA12(2,1) AA12(2,2) AA12(2,3) AA12(2,4) AA12(2,5)];
       elseif Asmax<=AA12(3,5) && Asmax>AA12(2,5)
             Ass2=[AA12(3,1) AA12(3,2) AA12(3,3) AA12(3,4) AA12(3,5)];
       elseif Asmax<=AA12(4,5) && Asmax>AA12(3,5)
             Ass2=[AA12(4,1) AA12(4,2) AA12(4,3) AA12(4,4) AA12(4,5)];
       elseif Asmax<=AA12(5,5) && Asmax>AA12(4,5)
             Ass2=[AA12(5,1) AA12(5,2) AA12(5,3) AA12(5,4) AA12(5,5)];
       elseif Asmax<=AA12(6,5) && Asmax>AA12(5,5)
             Ass2=[AA12(6,1) AA12(6,2) AA12(6,3) AA12(6,4) AA12(6,5)];
       elseif Asmax<=AA12(7,5) && Asmax>AA12(6,5)
             Ass2=[AA12(7,1) AA12(7,2) AA12(7,3) AA12(7,4) AA12(7,5)];      
       elseif Asmax<=AA12(8,5) && Asmax>AA12(7,5)
             Ass2=[AA12(8,1) AA12(8,2) AA12(8,3) AA12(8,4) AA12(8,5)];       
       elseif Asmax<=AA12(9,5) && Asmax>AA12(8,5)
             Ass2=[AA12(9,1) AA12(9,2) AA12(9,3) AA12(9,4) AA12(9,5)]; 
       elseif Asmax<=AA12(10,5) && Asmax>AA12(9,5)
             Ass2=[AA12(10,1) AA12(10,2) AA12(10,3) AA12(10,4) AA12(10,5)];             
       elseif Asmax<=AA12(11,5) && Asmax>AA12(10,5)
             Ass2=[AA12(11,1) AA12(11,2) AA12(11,3) AA12(11,4) AA12(11,5)];                  
       end
       
    elseif Astong<=AA13(1,5) && Asmax<=AA13(9,5)    %确定是否选择数组AA13
       if Asmax<=AA13(2,5)                      
             Ass2=[AA13(2,1) AA13(2,2) AA13(2,3) AA13(2,4) AA13(2,5)];
       elseif Asmax<=AA13(3,5) && Asmax>AA13(2,5)
             Ass2=[AA13(3,1) AA13(3,2) AA13(3,3) AA13(3,4) AA13(3,5)];
       elseif Asmax<=AA13(4,5) && Asmax>AA13(3,5)
             Ass2=[AA13(4,1) AA13(4,2) AA13(4,3) AA13(4,4) AA13(4,5)];
       elseif Asmax<=AA13(5,5) && Asmax>AA13(4,5)
             Ass2=[AA13(5,1) AA13(5,2) AA13(5,3) AA13(5,4) AA13(5,5)];
       elseif Asmax<=AA13(6,5) && Asmax>AA13(5,5)
             Ass2=[AA13(6,1) AA13(6,2) AA13(6,3) AA13(6,4) AA13(6,5)];
       elseif Asmax<=AA13(7,5) && Asmax>AA13(6,5)
             Ass2=[AA13(7,1) AA13(7,2) AA13(7,3) AA13(7,4) AA13(7,5)];      
       elseif Asmax<=AA13(8,5) && Asmax>AA13(7,5)
             Ass2=[AA13(8,1) AA13(8,2) AA13(8,3) AA13(8,4) AA13(8,5)];       
       elseif Asmax<=AA13(9,5) && Asmax>AA13(8,5)
             Ass2=[AA13(9,1) AA13(9,2) AA13(9,3) AA13(9,4) AA13(9,5)];                  
       end       
              
    elseif Astong<=AA14(1,5) && Asmax<=AA14(7,5)     %确定是否选择数组AA14
       if Asmax<=AA14(2,5)                      
             Ass2=[AA14(2,1) AA14(2,2) AA14(2,3) AA14(2,4) AA14(2,5)];
       elseif Asmax<=AA14(3,5) && Asmax>AA14(2,5)
             Ass2=[AA14(3,1) AA14(3,2) AA14(3,3) AA14(3,4) AA14(3,5)];
       elseif Asmax<=AA14(4,5) && Asmax>AA14(3,5)
             Ass2=[AA14(4,1) AA14(4,2) AA14(4,3) AA14(4,4) AA14(4,5)];
       elseif Asmax<=AA14(5,5) && Asmax>AA14(4,5)
             Ass2=[AA14(5,1) AA14(5,2) AA14(5,3) AA14(5,4) AA14(5,5)];
       elseif Asmax<=AA14(6,5) && Asmax>AA14(5,5)
             Ass2=[AA14(6,1) AA14(6,2) AA14(6,3) AA14(6,4) AA14(6,5)];
       elseif Asmax<=AA14(7,5) && Asmax>AA14(6,5)
             Ass2=[AA14(7,1) AA14(7,2) AA14(7,3) AA14(7,4) AA14(7,5)];              
       end
       
    end
    
end





