function [ Ass1 ] = fujinshuchu150( Asmax,Astong )
%此子函数用于负筋在所有数组里面选值
%间距150
%采用穷举法，将所有配筋形式全部建立数组。
AA01=[12  150   0   0   754;
      12  150  12  300  1131;
      12  150  14  300  1267;
      12  150  16  300  1424;
      12  150  12  150  1508;
      12  150  14  150  1780;
      12  150  16  150  2094];
%通长直径 间距 直径 间距 钢筋面积
AA02=[14   150  0   0    1026;
      14   150  12  300  1403;
      14   150  14  300  1539;
      14   150  16  300  1696;
      14   150  12  150  1780;
      14   150  18  300  1874;
      14   150  14  150  2052;
      14   150  16  150  2366;
      14   150  18  150  2722];
  
AA03=[16   150  0   0    1340;
      16   150  12  300  1717;
      16   150  14  300  1853;
      16   150  16  300  2010;
      16   150  12  150  2094;
      16   150  18  300  2188;
      16   150  14  150  2366;
      16   150  20  300  2387;
      16   150  16  150  2680;
      16   150  18  150  3036;
      16   150  20  150  3434];  
  
AA04=[18   150  0   0    1696;
      18   150  14  300  2209;
      18   150  16  300  2366;
      18   150  18  300  2544;
      18   150  14  150  2722;
      18   150  20  300  2743;
      18   150  22  300  2963;
      18   150  16  150  3036;
      18   150  18  150  3392;
      18   150  20  150  3790;
      18   150  22  150  4230]; 
  
AA05=[20   150  0   0    2094;
      20   150  16  300  2764;
      20   150  18  300  2942;
      20   150  20  300  3141;
      20   150  22  300  3361;
      20   150  16  150  3434;
      20   150  25  300  3730;
      20   150  18  150  3790;
      20   150  20  150  4188;
      20   150  22  150  4628;
      20   150  25  150  5366];
  
AA06=[22   150  0   0    2534;
      22   150  18  300  3384;
      22   150  20  300  3581;
      22   150  22  300  3801;
      22   150  25  300  4170;
      22   150  18  150  4230;
      22   150  20  150  4628;
      22   150  22  150  5068;
      22   150  25  150  5806];  
  
AA07=[25   150  0   0    3272;
      25   150  20  300  4319;
      25   150  22  300  4539;
      25   150  25  300  4908;
      25   150  20  150  5366;
      25   150  22  150  5806;
      25   150  25  150  6544];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%以上为间距150档  

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%间距150档选筋
    if Astong<=AA01(1,5) && Asmax<=AA01(7,5)                               %确定是否选择数组AA01
       if Asmax<=AA01(2,5)                      
             Ass1=[AA01(2,1) AA01(2,2) AA01(2,3) AA01(2,4) AA01(2,5)];
       elseif Asmax<=AA01(3,5) && Asmax>AA01(2,5)
             Ass1=[AA01(3,1) AA01(3,2) AA01(3,3) AA01(3,4) AA01(3,5)];          
       elseif Asmax<=AA01(4,5) && Asmax>AA01(3,5)
             Ass1=[AA01(4,1) AA01(4,2) AA01(4,3) AA01(4,4) AA01(4,5)];           
       elseif Asmax<=AA01(5,5) && Asmax>AA01(4,5)
             Ass1=[AA01(5,1) AA01(5,2) AA01(5,3) AA01(5,4) AA01(5,5)];             
       elseif Asmax<=AA01(6,5) && Asmax>AA01(5,5)
             Ass1=[AA01(6,1) AA01(6,2) AA01(6,3) AA01(6,4) AA01(6,5)];  
       elseif Asmax<=AA01(7,5) && Asmax>AA01(6,5)
             Ass1=[AA01(7,1) AA01(7,2) AA01(7,3) AA01(7,4) AA01(7,5)];                   
       end
       
    elseif Astong<=AA02(1,5) && Asmax<=AA02(9,5)         %确定是否选择数组AA02
       if Asmax<=AA02(2,5)                      
             Ass1=[AA02(2,1) AA02(2,2) AA02(2,3) AA02(2,4) AA02(2,5)];
       elseif Asmax<=AA02(3,5) && Asmax>AA02(2,5)
             Ass1=[AA02(3,1) AA02(3,2) AA02(3,3) AA02(3,4) AA02(3,5)];
       elseif Asmax<=AA02(4,5) && Asmax>AA02(3,5)
             Ass1=[AA02(4,1) AA02(4,2) AA02(4,3) AA02(4,4) AA02(4,5)];
       elseif Asmax<=AA02(5,5) && Asmax>AA02(4,5)
             Ass1=[AA02(5,1) AA02(5,2) AA02(5,3) AA02(5,4) AA02(5,5)];
       elseif Asmax<=AA02(6,5) && Asmax>AA02(5,5)
             Ass1=[AA02(6,1) AA02(6,2) AA02(6,3) AA02(6,4) AA02(6,5)];
       elseif Asmax<=AA02(7,5) && Asmax>AA02(6,5)
             Ass1=[AA02(7,1) AA02(7,2) AA02(7,3) AA02(7,4) AA02(7,5)];
       elseif Asmax<=AA02(8,5) && Asmax>AA02(7,5)
             Ass1=[AA02(8,1) AA02(8,2) AA02(8,3) AA02(8,4) AA02(8,5)];
       elseif Asmax<=AA02(9,5) && Asmax>AA02(8,5)
             Ass1=[AA02(9,1) AA02(9,2) AA02(9,3) AA02(9,4) AA02(9,5)];
       end
        
      elseif Astong<=AA03(1,5) && Asmax<=AA03(11,5)    %确定是否选择数组AA03
       if Asmax<=AA03(2,5)                      
             Ass1=[AA03(2,1) AA03(2,2) AA03(2,3) AA03(2,4) AA03(2,5)];
       elseif Asmax<=AA03(3,5) && Asmax>AA03(2,5)
             Ass1=[AA03(3,1) AA03(3,2) AA03(3,3) AA03(3,4) AA03(3,5)];
       elseif Asmax<=AA03(4,5) && Asmax>AA03(3,5)
             Ass1=[AA03(4,1) AA03(4,2) AA03(4,3) AA03(4,4) AA03(4,5)];
       elseif Asmax<=AA03(5,5) && Asmax>AA03(4,5)
             Ass1=[AA03(5,1) AA03(5,2) AA03(5,3) AA03(5,4) AA03(5,5)];
       elseif Asmax<=AA03(6,5) && Asmax>AA03(5,5)
             Ass1=[AA03(6,1) AA03(6,2) AA03(6,3) AA03(6,4) AA03(6,5)];
       elseif Asmax<=AA03(7,5) && Asmax>AA03(6,5)
             Ass1=[AA03(7,1) AA03(7,2) AA03(7,3) AA03(7,4) AA03(7,5)];
       elseif Asmax<=AA03(8,5) && Asmax>AA03(7,5)
             Ass1=[AA03(8,1) AA03(8,2) AA03(8,3) AA03(8,4) AA03(8,5)];             
       elseif Asmax<=AA03(9,5) && Asmax>AA03(8,5)
             Ass1=[AA03(9,1) AA03(9,2) AA03(9,3) AA03(9,4) AA03(9,5)];              
        elseif Asmax<=AA03(10,5) && Asmax>AA03(9,5)
             Ass1=[AA03(10,1) AA03(10,2) AA03(10,3) AA03(10,4) AA03(10,5)];             
        elseif Asmax<=AA03(11,5) && Asmax>AA03(10,5)
             Ass1=[AA03(11,1) AA03(11,2) AA03(11,3) AA03(11,4) AA03(11,5)];              
       end

       elseif Astong<=AA04(1,5) && Asmax<=AA04(11,5)    %确定是否选择数组AA04
       if Asmax<=AA04(2,5)                      
             Ass1=[AA04(2,1) AA04(2,2) AA04(2,3) AA04(2,4) AA04(2,5)];
       elseif Asmax<=AA04(3,5) && Asmax>AA04(2,5)
             Ass1=[AA04(3,1) AA04(3,2) AA04(3,3) AA04(3,4) AA04(3,5)];
       elseif Asmax<=AA04(4,5) && Asmax>AA04(3,5)
             Ass1=[AA04(4,1) AA04(4,2) AA04(4,3) AA04(4,4) AA04(4,5)];
       elseif Asmax<=AA04(5,5) && Asmax>AA04(4,5)
             Ass1=[AA04(5,1) AA04(5,2) AA04(5,3) AA04(5,4) AA04(5,5)];
       elseif Asmax<=AA04(6,5) && Asmax>AA04(5,5)
             Ass1=[AA04(6,1) AA04(6,2) AA04(6,3) AA04(6,4) AA04(6,5)];
       elseif Asmax<=AA04(7,5) && Asmax>AA04(6,5)
             Ass1=[AA04(7,1) AA04(7,2) AA04(7,3) AA04(7,4) AA04(7,5)];
       elseif Asmax<=AA04(8,5) && Asmax>AA04(7,5)
             Ass1=[AA04(8,1) AA04(8,2) AA04(8,3) AA04(8,4) AA04(8,5)];      
       elseif Asmax<=AA04(9,5) && Asmax>AA04(8,5)
             Ass1=[AA04(9,1) AA04(9,2) AA04(9,3) AA04(9,4) AA04(9,5)];      
       elseif Asmax<=AA04(10,5) && Asmax>AA04(9,5)
             Ass1=[AA04(10,1) AA04(10,2) AA04(10,3) AA04(10,4) AA04(10,5)];        
       elseif Asmax<=AA04(11,5) && Asmax>AA04(10,5)
             Ass1=[AA04(11,1) AA04(11,2) AA04(11,3) AA04(11,4) AA04(11,5)];         
       end
       
       elseif Astong<=AA05(1,5) && Asmax<=AA05(11,5)    %确定是否选择数组AA05
       if Asmax<=AA05(2,5)                      
             Ass1=[AA05(2,1) AA05(2,2) AA05(2,3) AA05(2,4) AA05(2,5)];
       elseif Asmax<=AA05(3,5) && Asmax>AA05(2,5)
             Ass1=[AA05(3,1) AA05(3,2) AA05(3,3) AA05(3,4) AA05(3,5)];
       elseif Asmax<=AA05(4,5) && Asmax>AA05(3,5)
             Ass1=[AA05(4,1) AA05(4,2) AA05(4,3) AA05(4,4) AA05(4,5)];
       elseif Asmax<=AA05(5,5) && Asmax>AA05(4,5)
             Ass1=[AA05(5,1) AA05(5,2) AA05(5,3) AA05(5,4) AA05(5,5)];
       elseif Asmax<=AA05(6,5) && Asmax>AA05(5,5)
             Ass1=[AA05(6,1) AA05(6,2) AA05(6,3) AA05(6,4) AA05(6,5)];
       elseif Asmax<=AA05(7,5) && Asmax>AA05(6,5)
             Ass1=[AA05(7,1) AA05(7,2) AA05(7,3) AA05(7,4) AA05(7,5)];
       elseif Asmax<=AA05(8,5) && Asmax>AA05(7,5)
             Ass1=[AA05(8,1) AA05(8,2) AA05(8,3) AA05(8,4) AA05(8,5)];      
       elseif Asmax<=AA05(9,5) && Asmax>AA05(8,5)
             Ass1=[AA05(9,1) AA05(9,2) AA05(9,3) AA05(9,4) AA05(9,5)];
       elseif Asmax<=AA05(10,5) && Asmax>AA05(9,5)
             Ass1=[AA05(10,1) AA05(10,2) AA05(10,3) AA05(10,4) AA05(10,5)];             
       elseif Asmax<=AA05(11,5) && Asmax>AA05(10,5)
             Ass1=[AA05(11,1) AA05(11,2) AA05(11,3) AA05(11,4) AA05(11,5)];               
       end       
       
       elseif Astong<=AA06(1,5) && Asmax<=AA06(9,5)    %确定是否选择数组AA06
       if Asmax<=AA06(2,5)                      
             Ass1=[AA06(2,1) AA06(2,2) AA06(2,3) AA06(2,4) AA06(2,5)];
       elseif Asmax<=AA06(3,5) && Asmax>AA06(2,5)
             Ass1=[AA06(3,1) AA06(3,2) AA06(3,3) AA06(3,4) AA06(3,5)];
       elseif Asmax<=AA06(4,5) && Asmax>AA06(3,5)
             Ass1=[AA06(4,1) AA06(4,2) AA06(4,3) AA06(4,4) AA06(4,5)];
       elseif Asmax<=AA06(5,5) && Asmax>AA06(4,5)
             Ass1=[AA06(5,1) AA06(5,2) AA06(5,3) AA06(5,4) AA06(5,5)];
       elseif Asmax<=AA06(6,5) && Asmax>AA06(5,5)
             Ass1=[AA06(6,1) AA06(6,2) AA06(6,3) AA06(6,4) AA06(6,5)];
       elseif Asmax<=AA06(7,5) && Asmax>AA06(6,5)
             Ass1=[AA06(7,1) AA06(7,2) AA06(7,3) AA06(7,4) AA06(7,5)];
       elseif Asmax<=AA06(8,5) && Asmax>AA06(7,5)
             Ass1=[AA06(8,1) AA06(8,2) AA06(8,3) AA06(8,4) AA06(8,5)];      
       elseif Asmax<=AA06(9,5) && Asmax>AA06(8,5)
             Ass1=[AA06(9,1) AA06(9,2) AA06(9,3) AA06(9,4) AA06(9,5)];                    
       end
       
       elseif Astong<=AA07(1,5) && Asmax<=AA07(7,5)     %确定是否选择数组AA07
       if Asmax<=AA07(2,5)                      
             Ass1=[AA07(2,1) AA07(2,2) AA07(2,3) AA07(2,4) AA07(2,5)];
       elseif Asmax<=AA07(3,5) && Asmax>AA07(2,5)
             Ass1=[AA07(3,1) AA07(3,2) AA07(3,3) AA07(3,4) AA07(3,5)];
       elseif Asmax<=AA07(4,5) && Asmax>AA07(3,5)
             Ass1=[AA07(4,1) AA07(4,2) AA07(4,3) AA07(4,4) AA07(4,5)];
       elseif Asmax<=AA07(5,5) && Asmax>AA07(4,5)
             Ass1=[AA07(5,1) AA07(5,2) AA07(5,3) AA07(5,4) AA07(5,5)];
       elseif Asmax<=AA07(6,5) && Asmax>AA07(5,5)
             Ass1=[AA07(6,1) AA07(6,2) AA07(6,3) AA07(6,4) AA07(6,5)];
       elseif Asmax<=AA07(7,5) && Asmax>AA07(6,5)
             Ass1=[AA07(7,1) AA07(7,2) AA07(7,3) AA07(7,4) AA07(7,5)];                    
       end
       
    end
    

end

