function [ Q ] = hezaijisuan( n,H,r,h,p0,rg,rq)
%输出各节点荷载设计值
%n——为挡墙层数
%H——为每层挡墙层高
%r——为填土容重
%h——为墙顶覆土厚度
%p0——为地面活荷载
%rg——恒载分项系数
%rq——活载分项系数
%挡墙计算宽度为1000mm
if n==1    
 qmax0g=r*0.5*(h+H(1,1));    %恒载标准值最大值,静止土压力系数为0.5
 qmin0g=r*0.5*h;             %恒载标准值最小值,静止土压力系数为0.5
 q0q=p0*0.5;                 %活载标准值,静止土压力系数为0.5

 qmaxg=qmax0g*rg;            %恒载设计值
 qming=qmin0g*rg;            %恒载设计值
 qq=q0q*rq*0.7;              %活载设计值，后期讨论一下组合值系数要不要乘

 qA=qmaxg+qq;                %A点荷载设计值
 qB=qming+qq;                %B点荷载设计值
 
 Q=[qA*1000 qB*1000];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
elseif n==2
 qmax0g=r*0.5*(h+H(1,1)+H(1,2));     %恒载标准值最大值,静止土压力系数为0.5
 qmin0g=r*0.5*h;                     %恒载标准值最小值,静止土压力系数为0.5
 q0q=p0*0.5;                         %活载标准值,静止土压力系数为0.5

 qmaxg=qmax0g*rg;            %恒载设计值
 qming=qmin0g*rg;            %恒载设计值
 qq=q0q*rq*0.7;                  %活载设计值

 qA=qmaxg+qq;                %A点荷载设计值
 qB=r*0.5*(h+H(1,2))*rg+qq;  %B点荷载设计值
 qC=qming+qq;                %C点荷载设计值 
 
 Q=[qA*1000 qB*1000 qC*1000];   
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
elseif n==3
 qmax0g=r*0.5*(h+H(1,1)+H(1,2)+H(1,3));     %恒载标准值最大值,静止土压力系数为0.5
 qmin0g=r*0.5*h;                            %恒载标准值最小值,静止土压力系数为0.5
 q0q=p0*0.5;                                %活载标准值,静止土压力系数为0.5

 qmaxg=qmax0g*rg;            %恒载设计值最大值
 qming=qmin0g*rg;            %恒载设计值最小值
 qq=q0q*rq*0.7;                  %活载设计值

 qA=qmaxg+qq;                       %A点荷载设计值
 qB=r*0.5*(h+H(1,2)+H(1,3))*rg+qq;  %B点荷载设计值
 qC=r*0.5*(h+H(1,3))*rg+qq;         %C点荷载设计值
 qD=qming+qq;                       %D点荷载设计值   
  
 Q=[qA*1000 qB*1000 qC*1000 qD*1000]; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
elseif n==4
 qmax0g=r*0.5*(h+H(1,1)+H(1,2)+H(1,3)+H(1,4));     %恒载标准值最大值,静止土压力系数为0.5
 qmin0g=r*0.5*h;                            %恒载标准值最小值,静止土压力系数为0.5
 q0q=p0*0.5;                                %活载标准值,静止土压力系数为0.5

 qmaxg=qmax0g*rg;            %恒载设计值最大值
 qming=qmin0g*rg;            %恒载设计值最小值
 qq=q0q*rq*0.7;                  %活载设计值

 qA=qmaxg+qq;                              %A点荷载设计值
 qB=r*0.5*(h+H(1,2)+H(1,3)+H(1,4))*rg+qq;  %B点荷载设计值
 qC=r*0.5*(h+H(1,3)+H(1,4))*rg+qq;         %C点荷载设计值
 qD=r*0.5*(h+H(1,4))*rg+qq;                %D点荷载设计值
 qE=qming+qq;                              %E点荷载设计值   
  
 Q=[qA*1000 qB*1000 qC*1000 qD*1000 qE*1000]; 
end    
end

