function [ Mmax ] = kuazhongzuidaM(M,n,Q,H)
%本子函数用于求出跨中最大正弯矩
%输入的M列向量为各节点内力,n为挡墙层数
% Q=hezaijisuan( n,H,r,h,p0,rg,rq);    %调用荷载计算子程序，
Mmax=zeros(1,4);%定义一个1x4的0向量，其中第N个元素为第N层的最大弯矩设计值

if n==1
x1=(Q(2)+sqrt(Q(2)^2+2*(Q(1)-Q(2))*M(2,2)/H(1)))*H(1)/(Q(2)-Q(1));               %一层挡墙AB的剪力为0处的距离墙顶的距离
x2=(Q(2)-sqrt(Q(2)^2+2*(Q(1)-Q(2))*M(2,2)/H(1)))*H(1)/(Q(2)-Q(1));
   if x1>0 && x1<H(1)
       x0=x1;
   else
       x0=x2;
   end
Mmax=[-(Q(1)-Q(2))*x0^3/(6*H(1))-0.5*Q(2)*x0^2+M(2,2)*x0 0 0 0];   

elseif n==2
x1=(Q(3)+sqrt(Q(3)^2+2*(Q(2)-Q(3))*M(2,3)/H(2)))*H(2)/(Q(3)-Q(2));               %二层挡墙BC的剪力为0处的距离墙顶的距离
x2=(Q(3)-sqrt(Q(3)^2+2*(Q(2)-Q(3))*M(2,3)/H(2)))*H(2)/(Q(3)-Q(2));
   if x1>0 && x1<H(2)
       x0=x1;
   else
       x0=x2;
   end    
x11=(Q(3)+sqrt(Q(3)^2+2*(Q(2)-Q(3))*(M(2,3)+M(2,2))/H(2)))*H(2)/(Q(3)-Q(2));       %一层挡墙AB的剪力为0处的距离墙顶的距离
x22=(Q(3)-sqrt(Q(3)^2+2*(Q(2)-Q(3))*(M(2,3)+M(2,2))/H(2)))*H(2)/(Q(3)-Q(2));
   if x11>H(2) && x11<H(1)+H(2)
       x00=x11;
   else
       x00=x22;
   end 
Mmax=[-(Q(2)-Q(3))*x00^3/(6*H(2))-0.5*Q(3)*x00^2+M(2,3)*x00+M(2,2)*(x00-H(2))  -(Q(2)-Q(3))*x0^3/(6*H(2))-0.5*Q(3)*x0^2+M(2,3)*x0 0 0];       

elseif n==3
x1=(Q(4)+sqrt(Q(4)^2+2*(Q(3)-Q(4))*M(2,4)/H(3)))*H(3)/(Q(4)-Q(3));              %三层挡墙CD的剪力为0处的距离墙顶的距离
x2=(Q(4)-sqrt(Q(4)^2+2*(Q(3)-Q(4))*M(2,4)/H(3)))*H(3)/(Q(4)-Q(3));
   if x1>0 && x1<H(3)
       x0=x1;
   else
       x0=x2;
   end      
x11=(Q(4)+sqrt(Q(4)^2+2*(Q(3)-Q(4))*(M(2,3)+M(2,4))/H(3)))*H(3)/(Q(4)-Q(3));      %二层挡墙BC的剪力为0处的距离墙顶的距离
x22=(Q(4)-sqrt(Q(4)^2+2*(Q(3)-Q(4))*(M(2,3)+M(2,4))/H(3)))*H(3)/(Q(4)-Q(3));   
   if x11>H(3) && x11<H(3)+H(2)
       x00=x11;
   else
       x00=x22;
   end      
x111=(Q(4)+sqrt(Q(4)^2+2*(Q(3)-Q(4))*(M(2,2)+M(2,3)+M(2,4))/H(3)))*H(3)/(Q(4)-Q(3));%一层挡墙AB的剪力为0处的距离墙顶的距离
x222=(Q(4)-sqrt(Q(4)^2+2*(Q(3)-Q(4))*(M(2,2)+M(2,3)+M(2,4))/H(3)))*H(3)/(Q(4)-Q(3)); 
   if x111>H(3)+H(2) && x111<H(3)+H(2)+H(1)
       x000=x111;
   else
       x000=x222;
   end 
Mmax=[-(Q(3)-Q(4))*x000^3/(6*H(3))-0.5*Q(4)*x000^2+M(2,4)*x000+M(2,3)*(x000-H(3))+M(2,2)*(x000-H(3)-H(2))
      -(Q(3)-Q(4))*x00^3/(6*H(3))-0.5*Q(4)*x00^2+M(2,4)*x00+M(2,3)*(x00-H(3)) 
      -(Q(3)-Q(4))*x0^3/(6*H(3))-0.5*Q(4)*x0^2+M(2,4)*x0
      0];     

elseif n==4
x1=(Q(5)+sqrt(Q(5)^2+2*(Q(4)-Q(5))*M(2,5)/H(4)))*H(4)/(Q(5)-Q(4));                %四层挡墙DE的剪力为0处的距离墙顶的距离
x2=(Q(5)-sqrt(Q(5)^2+2*(Q(4)-Q(5))*M(2,5)/H(4)))*H(4)/(Q(5)-Q(4)); 
   if x1>0 && x1<H(4)
       x0=x1;
   else
       x0=x2;
   end 
x11=(Q(5)+sqrt(Q(5)^2+2*(Q(4)-Q(5))*(M(2,4)+M(2,5))/H(4)))*H(4)/(Q(5)-Q(4));       %三层挡墙CD的剪力为0处的距离墙顶的距离
x22=(Q(5)-sqrt(Q(5)^2+2*(Q(4)-Q(5))*(M(2,4)+M(2,5))/H(4)))*H(4)/(Q(5)-Q(4));   
   if x11>H(4) && x11<H(4)+H(3)
       x00=x11;
   else
       x00=x22;
   end     
x111=(Q(5)+sqrt(Q(5)^2+2*(Q(4)-Q(5))*(M(2,3)+M(2,4)+M(2,5))/H(4)))*H(4)/(Q(5)-Q(4));  %二层挡墙BC的剪力为0处的距离墙顶的距离
x222=(Q(5)-sqrt(Q(5)^2+2*(Q(4)-Q(5))*(M(2,3)+M(2,4)+M(2,5))/H(4)))*H(4)/(Q(5)-Q(4)); 
   if x111>H(3)+H(4) && x111<H(4)+H(3)+H(2)
       x000=x111;
   else
       x000=x222;
   end     
x1111=(Q(5)+sqrt(Q(5)^2+2*(Q(4)-Q(5))*(M(2,2)+M(2,3)+M(2,4)+M(2,5))/H(4)))*H(4)/(Q(5)-Q(4));  %一层挡墙BC的剪力为0处的距离墙顶的距离
x2222=(Q(5)-sqrt(Q(5)^2+2*(Q(4)-Q(5))*(M(2,2)+M(2,3)+M(2,4)+M(2,5))/H(4)))*H(4)/(Q(5)-Q(4)); 
   if x1111>H(4)+H(3)+H(2) && x1111<H(4)+H(3)+H(2)+H(1)
       x0000=x1111;
   else
       x0000=x2222;
   end     
Mmax=[-(Q(4)-Q(5))*x0000^3/(6*H(4))-0.5*Q(5)*x0000^2+M(2,5)*x0000+M(2,4)*(x0000-H(4))+M(2,3)*(x0000-H(3)-H(4))+M(2,2)*(x0000-H(2)-H(3)-H(4))
      -(Q(4)-Q(5))*x000^3/(6*H(4))-0.5*Q(5)*x000^2+M(2,5)*x000+M(2,4)*(x000-H(4))+M(2,3)*(x000-H(3)-H(4)) 
      -(Q(4)-Q(5))*x00^3/(6*H(4))-0.5*Q(5)*x00^2+M(2,5)*x00+M(2,4)*(x00-H(4))
      -(Q(4)-Q(5))*x0^3/(6*H(4))-0.5*Q(5)*x0^2+M(2,5)*x0 ];     
    
  
end

