function [ M ] = neilijisuan02( E,A,I,k,f,n,Q,H )
%本子函数用于求解节点位移和结构内力以及支座反力,适用于墙底铰接
%输入的k为总刚度矩阵（未引入位移边界条件划掉0行0列），f为等效节点荷载列向量（未引入位移边界条件划掉0行0列）,n为挡土墙层数
%Q=hezaijisuan( n,H,r,h,p0,rg,rq);    %调用荷载计算子程序，计算所有节点的荷载设计值
u=k\f;%左除总刚度矩阵，求解未知位移
vpa(u,7);             %将求解的位移保留7位有效数字
if n==1
                      %求支反力，此支反力为未加上全部加上刚臂时，只有节点荷载的支反力
                      %支反力修正为真正结构的支反力，令F+结构全部加上刚臂时的节点反力，得到真正结构的内力和支反力
k01=PlaneFrameElementStiffness(E(1),A(1),I(1),H(1));%得到单元1的单元刚度矩阵
F01=k01*[0;0;u(1);u(2);0;u(3)];
                      
Fa=(Q(1,1)-Q(1,2))*H(1,1)*7/20+0.5*Q(1,2)*H(1,1);                     %A点等效节点剪力(不反号)
Ma=(Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/20+Q(1,2)*H(1,1)*H(1,1)/12;          %A点等效节点弯矩(不反号)
Fb=(Q(1,1)-Q(1,2))*H(1,1)*3/20+0.5*Q(1,2)*H(1,1);                     %B点等效节点剪力(不反号)
Mb=-((Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/30+Q(1,2)*H(1,1)*H(1,1)/12);       %B点等效节点弯矩(不反号)
F=[F01(3)+Ma F01(6)+Mb;                                               %各节点弯矩    A弯矩   B弯矩
   F01(2)+Fa F01(5)+Fb];                                              %各节点支反力  A支反力  B支反力  
M=F;

elseif n==2
                                  %求支反力，此支反力为未加上全部加上刚臂时，只有节点荷载的支反力
                                  %支反力修正为真正结构的支反力，令F+结构全部加上刚臂时的节点反力，得到真正结构的内力和支反力
k01=PlaneFrameElementStiffness(E(1),A(1),I(1),H(1));%得到单元1的单元刚度矩阵
F01=k01*[0;0;u(1);u(2);0;u(3)];                        %得到1单元各节点内力
k02=PlaneFrameElementStiffness(E(1),A(2),I(2),H(2));%得到单元2的单元刚度矩阵
F02=k02*[u(2);0;u(3);u(4);0;u(5)];                  %得到2单元各节点内力

Ma=(Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/20+Q(1,2)*H(1,1)*H(1,1)/12;             %A点等效节点弯矩(不反号)
Fa=(Q(1,1)-Q(1,2))*H(1,1)*7/20+0.5*Q(1,2)*H(1,1);                        %A点等效节点剪力(不反号)
Mbl=-(((Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/30+Q(1,2)*H(1,1)*H(1,1)/12));       %B点左侧等效节点弯矩(不反号)
Mbr=(Q(1,2)-Q(1,3))*H(1,2)*H(1,2)/20+Q(1,3)*H(1,2)*H(1,2)/12;            %B点右侧等效节点弯矩(不反号)
Fbl=(Q(1,1)-Q(1,2))*H(1,1)*3/20+0.5*Q(1,2)*H(1,1);                       %B点左侧等效节点剪力(不反号) 
Fbr=(Q(1,2)-Q(1,3))*H(1,2)*7/20+0.5*Q(1,3)*H(1,2);                       %B点右侧等效节点剪力(不反号) 
Mc=-((Q(1,2)-Q(1,3))*H(1,2)*H(1,2)/30+Q(1,3)*H(1,2)*H(1,2)/12);          %C点等效节点弯矩(不反号)              
Fc=(Q(1,2)-Q(1,3))*H(1,2)*3/20+0.5*Q(1,3)*H(1,2);                        %C点等效节点剪力(不反号)
F=[F01(3)+Ma F01(6)+Mbl F02(3)+Mbr F02(6)+Mc;                            %各节点弯矩    A弯矩   B左侧弯矩 B右侧弯矩 C弯矩  
   F01(2)+Fa F01(5)+Fbl+F02(2)+Fbr F02(5)+Fc 0];                           %各节点支反力  A支反力  B支反力  C支反力
M=F;

elseif n==3
                                                          %求支反力，此支反力为未加上全部加上刚臂时，只有节点荷载的支反力
                                                          %支反力修正为真正结构的支反力，令F+结构全部加上刚臂时的节点反力，得到真正结构的内力和支反力
k01=PlaneFrameElementStiffness(E(1),A(1),I(1),H(1));      %得到单元1的单元刚度矩阵
F01=k01*[0;0;u(1);u(2);0;u(3)];                           %得到1单元各节点内力
k02=PlaneFrameElementStiffness(E(1),A(2),I(2),H(2));      %得到单元2的单元刚度矩阵
F02=k02*[u(2);0;u(3);u(4);0;u(5)];                        %得到2单元各节点内力                                                                                            
k03=PlaneFrameElementStiffness(E(1),A(3),I(3),H(3));      %得到单元3的单元刚度矩阵
F03=k03*[u(4);0;u(5);u(6);0;u(7)];                        %得到3单元各节点内力                                               
                                                                                           
Ma=(Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/20+Q(1,2)*H(1,1)*H(1,1)/12;          %A点等效节点弯矩(不反号)
Fa=(Q(1,1)-Q(1,2))*H(1,1)*7/20+0.5*Q(1,2)*H(1,1);                     %A点等效节点剪力(不反号)
Mbl=-((Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/30+Q(1,2)*H(1,1)*H(1,1)/12);      %B点左侧等效节点弯矩(不反号)
Mbr=(Q(1,2)-Q(1,3))*H(1,2)*H(1,2)/20+Q(1,3)*H(1,2)*H(1,2)/12;         %B点右侧等效节点弯矩(不反号)
Fbl=(Q(1,1)-Q(1,2))*H(1,1)*3/20+0.5*Q(1,2)*H(1,1);                    %B点左侧等效节点剪力(不反号)                     
Fbr=(Q(1,2)-Q(1,3))*H(1,2)*7/20+0.5*Q(1,3)*H(1,2);                    %B点右侧等效节点剪力(不反号)
Mcl=-((Q(1,2)-Q(1,3))*H(1,2)*H(1,2)/30+Q(1,3)*H(1,2)*H(1,2)/12);      %C点左侧等效节点弯矩(不反号)   
Mcr=(Q(1,3)-Q(1,4))*H(1,3)*H(1,3)/20+Q(1,4)*H(1,3)*H(1,3)/12;         %C点右侧等效节点弯矩(不反号)
Fcl=(Q(1,2)-Q(1,3))*H(1,2)*3/20+0.5*Q(1,3)*H(1,2);                    %C点左侧等效节点剪力 (不反号)                
Fcr=(Q(1,3)-Q(1,4))*H(1,3)*7/20+0.5*Q(1,4)*H(1,3);                    %C点右侧等效节点剪力 (不反号)
Md=-((Q(1,3)-Q(1,4))*H(1,3)*H(1,3)/30+Q(1,4)*H(1,3)*H(1,3)/12);       %D点等效节点弯矩(不反号)
Fd=(Q(1,3)-Q(1,4))*H(1,3)*3/20+0.5*Q(1,4)*H(1,3);                     %D点等效节点剪力(不反号)

F=[F01(3)+Ma F01(6)+Mbl F02(3)+Mbr F02(6)+Mcl F03(3)+Mcr F03(6)+Md;   %各节点弯矩   A弯矩   B左侧弯矩  B右侧弯矩 C左侧弯矩 C右侧弯矩 D弯矩  
   F01(2)+Fa F01(5)+Fbl+F02(2)+Fbr F02(5)+Fcl+F03(2)+Fcr F03(5)+Fd 0 0];  %各节点支反力 A支反力  B支反力   C支反力   D支反力
M=F;

elseif n==4
                                                          %求支反力，此支反力为未加上全部加上刚臂时，只有节点荷载的支反力
                                                          %支反力修正为真正结构的支反力，令F+结构全部加上刚臂时的节点反力，得到真正结构的内力和支反力
k01=PlaneFrameElementStiffness(E(1),A(1),I(1),H(1));      %得到单元1的单元刚度矩阵
F01=k01*[0;0;u(1);u(2);0;u(3)];                           %得到1单元各节点内力
k02=PlaneFrameElementStiffness(E(1),A(2),I(2),H(2));      %得到单元2的单元刚度矩阵
F02=k02*[u(2);0;u(3);u(4);0;u(5)];                        %得到2单元各节点内力                                                                                            
k03=PlaneFrameElementStiffness(E(1),A(3),I(3),H(3));      %得到单元3的单元刚度矩阵
F03=k03*[u(4);0;u(5);u(6);0;u(7)];                        %得到3单元各节点内力
k04=PlaneFrameElementStiffness(E(1),A(4),I(4),H(4));      %得到单元4的单元刚度矩阵
F04=k04*[u(6);0;u(7);u(8);0;u(9)];                        %得到4单元各节点内力
                                                         
Ma=(Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/20+Q(1,2)*H(1,1)*H(1,1)/12;          %A点等效节点弯矩(不反号)
Fa=(Q(1,1)-Q(1,2))*H(1,1)*7/20+0.5*Q(1,2)*H(1,1);                     %A点等效节点剪力(不反号)
Mbl=-(((Q(1,1)-Q(1,2))*H(1,1)*H(1,1)/30+Q(1,2)*H(1,1)*H(1,1)/12));    %B点左侧等效节点弯矩(不反号)
Mbr=(Q(1,2)-Q(1,3))*H(1,2)*H(1,2)/20+Q(1,3)*H(1,2)*H(1,2)/12;         %B点右侧等效节点弯矩(不反号)
Fbl=(Q(1,1)-Q(1,2))*H(1,1)*3/20+0.5*Q(1,2)*H(1,1);                    %B点左侧等效节点剪力(不反号)
Fbr=(Q(1,2)-Q(1,3))*H(1,2)*7/20+0.5*Q(1,3)*H(1,2);                    %B点右侧等效节点剪力(不反号)
Mcl=-((Q(1,2)-Q(1,3))*H(1,2)*H(1,2)/30+Q(1,3)*H(1,2)*H(1,2)/12);      %C点左侧等效节点弯矩(不反号)
Mcr=(Q(1,3)-Q(1,4))*H(1,3)*H(1,3)/20+Q(1,4)*H(1,3)*H(1,3)/12;         %C点右侧等效节点弯矩(不反号)
Fcl=(Q(1,2)-Q(1,3))*H(1,2)*3/20+0.5*Q(1,3)*H(1,2);                    %C点左侧等效节点剪力(不反号)
Fcr=(Q(1,3)-Q(1,4))*H(1,3)*7/20+0.5*Q(1,4)*H(1,3);                    %C点右侧等效节点剪力(不反号)
Mdl=-((Q(1,3)-Q(1,4))*H(1,3)*H(1,3)/30+Q(1,4)*H(1,3)*H(1,3)/12);      %D点左侧等效节点弯矩(不反号) 
Mdr=(Q(1,4)-Q(1,5))*H(1,4)*H(1,4)/20+Q(1,5)*H(1,4)*H(1,4)/12;         %D点右侧等效节点弯矩(不反号) 
Fdl=(Q(1,3)-Q(1,4))*H(1,3)*3/20+0.5*Q(1,4)*H(1,3);                    %D点左侧等效节点剪力(不反号)
Fdr=(Q(1,4)-Q(1,5))*H(1,4)*7/20+0.5*Q(1,5)*H(1,4);                    %D点右侧等效节点剪力(不反号)
Me=-((Q(1,4)-Q(1,5))*H(1,4)*H(1,4)/30+Q(1,5)*H(1,4)*H(1,4)/12);       %E点等效节点弯矩   
Fe=(Q(1,4)-Q(1,5))*H(1,4)*3/20+0.5*Q(1,5)*H(1,4);                     %E点等效节点剪力

F=[F01(3)+Ma F01(6)+Mbl F02(3)+Mbr F02(6)+Mcl F03(3)+Mcr F03(6)+Mdl F04(3)+Mdr F04(6)+Me;  %各节点弯矩   A弯矩   B左侧弯矩  B右侧弯矩 C左侧弯矩 C右侧弯矩 D左侧弯矩 D右侧弯矩 E弯矩 
   F01(2)+Fa F01(5)+Fbl+F02(2)+Fbr F02(5)+Fcl+F03(2)+Fcr F03(5)+Fdl+F04(2)+Fdr F04(5)+Fe 0 0 0]; %各节点支反力 A支反力  B支反力   C支反力   D支反力   E支反力
M=F;
end
end