function [ A ] = peijinxietiao200(A1,M,cs,h,C,rg)
%此子函数用于底层A、B两点负筋通长筋配筋协调，负筋间距为200
%A1为A点的[直径 间距 直径 间距 面积 裂缝宽度          A点数据
%          直径 间距 直径 间距 面积 裂缝宽度];        B点数据
%注意，此子函数默认为A点配筋值大于B点，若不满足此条件，则不可用
AA01=[12   200  0   0    565;
      12   200  12  400  848;
      12   200  14  400  950;
      12   200  16  400  1068;
      12   200  12  200  1130;
      12   200  14  200  1335;
      12   200  16  200  1570];
  
AA02=[14   200  0   0    770;
      14   200  12  400  1053;
      14   200  14  400  1155;
      14   200  16  400  1273;
      14   200  12  200  1335;
      14   200  18  400  1406;
      14   200  14  200  1540;
      14   200  16  200  1775;
      14   200  18  200  2042];
  
AA03=[16   200  0   0    1005;
      16   200  12  400  1288;
      16   200  14  400  1390;
      16   200  16  400  1508;
      16   200  12  200  1570;
      16   200  18  400  1641;
      16   200  14  200  1775;
      16   200  20  400  1790;
      16   200  16  200  2010;
      16   200  18  200  2277;
      16   200  20  200  2576]; 

AA04=[18   200  0   0    1272;
      18   200  14  400  1657;
      18   200  16  400  1775;
      18   200  18  400  1908;
      18   200  14  200  2042;
      18   200  20  400  2057;
      18   200  22  400  2222;
      18   200  16  200  2277;
      18   200  18  200  2544;
      18   200  20  200  2843;
      18   200  22  200  3173];
 
AA05=[20   200  0   0    1571;
      20   200  16  400  2074;
      20   200  18  400  2207;
      20   200  20  400  2356;
      20   200  22  400  2521;
      20   200  16  200  2576;
      20   200  25  400  2798;
      20   200  18  200  2843;
      20   200  20  200  3142;
      20   200  22  200  3472;
      20   200  25  200  4025];
  
AA06=[22   200  0   0    1901;
      22   200  18  400  2537;
      22   200  20  400  2686;
      22   200  22  400  2851;
      22   200  25  400  3128;
      22   200  18  200  3173;
      22   200  20  200  3472;
      22   200  22  200  3802;
      22   200  25  200  4355];
  
AA07=[25   200  0   0    2454;
      25   200  20  400  3239;
      25   200  22  400  3404;
      25   200  25  400  3681;
      25   200  20  200  4025;
      25   200  22  200  4355;
      25   200  25  200  4908];
  
if A1(1,1)>=A1(2,1)
    A1(2,1)=A1(1,1);
    if A1(1,1)==12
        if A1(2,5)<=AA01(2,5)
            A1(2,3)=AA01(2,3);
            A1(2,4)=AA01(2,4);
            A1(2,5)=AA01(2,5);
            d=[AA01(2,1) fix(1000/AA01(2,2)) AA01(2,3) fix(1000/AA01(2,4))];            
            w1=liefeng1(M(3),cs,d,AA01(2,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA01(2,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
            
        elseif A1(2,5)>AA01(2,5) && A1(2,5)<=AA01(3,5)
            A1(2,3)=AA01(3,3);
            A1(2,4)=AA01(3,4);
            A1(2,5)=AA01(3,5);
            d=[AA01(3,1) fix(1000/AA01(3,2)) AA01(3,3) fix(1000/AA01(3,4))];            
            w1=liefeng1(M(3),cs,d,AA01(3,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA01(3,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(2,1) fix(1000/AA01(2,2)) AA01(2,3) fix(1000/AA01(2,4))];
            ww1=liefeng1(M(3),cs,dd,AA01(2,5),h(1),C,rg);
            ww2=liefeng1(M(3),cs,dd,AA01(2,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2                               %M（2）为B点的弯矩
                 A1(2,3)=AA01(2,3);
                 A1(2,4)=AA01(2,4);
                 A1(2,5)=AA01(2,5); 
                 A1(2,6)=ww;
            end
                        
        elseif A1(2,5)>AA01(3,5) && A1(2,5)<=AA01(4,5)
            A1(2,3)=AA01(4,3);
            A1(2,4)=AA01(4,4);
            A1(2,5)=AA01(4,5);
            d=[AA01(4,1) fix(1000/AA01(4,2)) AA01(4,3) fix(1000/AA01(4,4))];            
            w1=liefeng1(M(3),cs,d,AA01(4,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA01(4,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(3,1) fix(1000/AA01(3,2)) AA01(3,3) fix(1000/AA01(3,4))];
            ww1=liefeng1(M(3),cs,dd,AA01(3,5),h(1),C,rg);%M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA01(3,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2                   
                 A1(2,3)=AA01(3,3);
                 A1(2,4)=AA01(3,4);
                 A1(2,5)=AA01(3,5);
                 A1(2,6)=ww;
            end            
                        
        elseif A1(2,5)>AA01(4,5) && A1(2,5)<=AA01(5,5)
            A1(2,3)=AA01(5,3);
            A1(2,4)=AA01(5,4);
            A1(2,5)=AA01(5,5);
            d=[AA01(5,1) fix(1000/AA01(5,2)) AA01(5,3) fix(1000/AA01(5,4))];            
            w1=liefeng1(M(3),cs,d,AA01(5,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA01(5,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(4,1) fix(1000/AA01(4,2)) AA01(4,3) fix(1000/AA01(4,4))];
            ww1=liefeng1(M(3),cs,dd,AA01(4,5),h(1),C,rg);%M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA01(4,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2                   
                 A1(2,3)=AA01(4,3);
                 A1(2,4)=AA01(4,4);
                 A1(2,5)=AA01(4,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA01(5,5) && A1(2,5)<=AA01(6,5)
            A1(2,3)=AA01(6,3);
            A1(2,4)=AA01(6,4);
            A1(2,5)=AA01(6,5);
            d=[AA01(6,1) fix(1000/AA01(6,2)) AA01(6,3) fix(1000/AA01(6,4))];            
            w1=liefeng1(M(3),cs,d,AA01(6,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA01(6,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(5,1) fix(1000/AA01(5,2)) AA01(5,3) fix(1000/AA01(5,4))];
            ww1=liefeng1(M(3),cs,dd,AA01(5,5),h(1),C,rg); %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA01(5,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2                  
                 A1(2,3)=AA01(5,3);
                 A1(2,4)=AA01(5,4);
                 A1(2,5)=AA01(5,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA01(6,5) && A1(2,5)<=AA01(7,5)
            A1(2,3)=AA01(7,3);
            A1(2,4)=AA01(7,4);
            A1(2,5)=AA01(7,5);
            d=[AA01(7,1) fix(1000/AA01(7,2)) AA01(7,3) fix(1000/AA01(7,4))];            
            w1=liefeng1(M(3),cs,d,AA01(7,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA01(7,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(6,1) fix(1000/AA01(6,2)) AA01(6,3) fix(1000/AA01(6,4))];
            ww1=liefeng1(M(3),cs,dd,AA01(6,5),h(1),C,rg);
            ww2=liefeng1(M(3),cs,dd,AA01(6,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2                   %M（2）为B点的弯矩
                 A1(2,3)=AA01(6,3);
                 A1(2,4)=AA01(6,4);
                 A1(2,5)=AA01(6,5); 
                 A1(2,6)=ww;
            end                         
        end
  A=A1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%        
   elseif A1(1,1)==14
        if A1(2,5)<=AA02(2,5)
            A1(2,3)=AA02(2,3);
            A1(2,4)=AA02(2,4);
            A1(2,5)=AA02(2,5);
            d=[AA02(2,1) fix(1000/AA02(2,2)) AA02(2,3) fix(1000/AA02(2,4))];
            w1=liefeng1(M(3),cs,d,AA02(2,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA02(2,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
                      
        elseif A1(2,5)>AA02(2,5) && A1(2,5)<=AA02(3,5)
            A1(2,3)=AA02(3,3);
            A1(2,4)=AA02(3,4);
            A1(2,5)=AA02(3,5);
            d=[AA02(3,1) fix(1000/AA02(3,2)) AA02(3,3) fix(1000/AA02(3,4))];
            w1=liefeng1(M(3),cs,d,AA02(3,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA02(3,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(2,1) fix(1000/AA02(2,2)) AA02(2,3) fix(1000/AA02(2,4))];
            ww1=liefeng1(M(3),cs,dd,AA02(2,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA02(2,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA02(2,3);
                 A1(2,4)=AA02(2,4);
                 A1(2,5)=AA02(2,5);
                 A1(2,6)=ww;
            end  
                        
        elseif A1(2,5)>AA02(3,5) && A1(2,5)<=AA02(4,5)
            A1(2,3)=AA02(4,3);
            A1(2,4)=AA02(4,4);
            A1(2,5)=AA02(4,5);
            d=[AA02(4,1) fix(1000/AA02(4,2)) AA02(4,3) fix(1000/AA02(4,4))];
            w1=liefeng1(M(3),cs,d,AA02(4,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA02(4,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(3,1) fix(1000/AA02(3,2)) AA02(3,3) fix(1000/AA02(3,4))];
            ww1=liefeng1(M(3),cs,dd,AA02(3,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA02(3,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA02(3,3);
                 A1(2,4)=AA02(3,4);
                 A1(2,5)=AA02(3,5);
                 A1(2,6)=ww;
            end
            
        elseif A1(2,5)>AA02(4,5) && A1(2,5)<=AA02(5,5)
            A1(2,3)=AA02(5,3); 
            A1(2,4)=AA02(5,4);
            A1(2,5)=AA02(4,5);
            d=[AA02(5,1) fix(1000/AA02(5,2)) AA02(5,3) fix(1000/AA02(5,4))];
            w1=liefeng1(M(3),cs,d,AA02(5,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA02(5,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(4,1) fix(1000/AA02(4,2)) AA02(4,3) fix(1000/AA02(4,4))];
            ww1=liefeng1(M(3),cs,dd,AA02(4,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA02(4,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA02(4,3);
                 A1(2,4)=AA02(4,4);
                 A1(2,5)=AA02(4,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA02(5,5) && A1(2,5)<=AA02(6,5)
            A1(2,3)=AA02(6,3);
            A1(2,4)=AA02(6,4);
            A1(2,5)=AA02(6,5);
            d=[AA02(6,1) fix(1000/AA02(6,2)) AA02(6,3) fix(1000/AA02(6,4))];
            w1=liefeng1(M(3),cs,d,AA02(6,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA02(6,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(5,1) fix(1000/AA02(5,2)) AA02(5,3) fix(1000/AA02(5,4))];
            ww1=liefeng1(M(3),cs,dd,AA02(5,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA02(5,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA02(5,3);
                 A1(2,4)=AA02(5,4);
                 A1(2,5)=AA02(5,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA02(6,5) && A1(2,5)<=AA02(7,5)
            A1(2,3)=AA02(7,3);
            A1(2,4)=AA02(7,4);
            A1(2,5)=AA02(7,5);
            d=[AA02(7,1) fix(1000/AA02(7,2)) AA02(7,3) fix(1000/AA02(7,4))];
            w1=liefeng1(M(3),cs,d,AA02(7,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA02(7,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(6,1) fix(1000/AA02(6,2)) AA02(6,3) fix(1000/AA02(6,4))];
            ww1=liefeng1(M(3),cs,dd,AA02(6,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA02(6,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA02(6,3);
                 A1(2,4)=AA02(6,4);
                 A1(2,5)=AA02(6,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA02(7,5) && A1(2,5)<=AA02(8,5)
            A1(2,3)=AA02(8,3);
            A1(2,4)=AA02(8,4);
            A1(2,5)=AA02(8,5);
            d=[AA02(8,1) fix(1000/AA02(8,2)) AA02(8,3) fix(1000/AA02(8,4))];
            w1=liefeng1(M(3),cs,d,AA02(8,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA02(8,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(7,1) fix(1000/AA02(7,2)) AA02(7,3) fix(1000/AA02(7,4))];
            ww1=liefeng1(M(3),cs,dd,AA02(7,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA02(7,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA02(7,3);
                 A1(2,4)=AA02(7,4);
                 A1(2,5)=AA02(7,5);
                 A1(2,6)=ww;
            end             
                        
        elseif A1(2,5)>AA02(8,5) && A1(2,5)<=AA02(9,5)
            A1(2,3)=AA02(9,3);
            A1(2,4)=AA02(9,4);
            A1(2,5)=AA02(9,5);
            d=[AA02(9,1) fix(1000/AA02(9,2)) AA02(9,3) fix(1000/AA02(9,4))];
            w1=liefeng1(M(3),cs,d,AA02(9,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA02(9,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(8,1) fix(1000/AA02(8,2)) AA02(8,3) fix(1000/AA02(8,4))];
            ww1=liefeng1(M(3),cs,dd,AA02(8,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA02(8,5),h(2),C,rg); 
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA02(8,3);
                 A1(2,4)=AA02(8,4);
                 A1(2,5)=AA02(8,5);
                 A1(2,6)=ww;
            end                       
        end
   A=A1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%    
      
   elseif A1(1,1)==16
        if A1(2,5)<=AA03(2,5)
            A1(2,3)=AA03(2,3);
            A1(2,4)=AA03(2,4);
            A1(2,5)=AA03(2,5);
            d=[AA03(2,1) fix(1000/AA03(2,2)) AA03(2,3) fix(1000/AA03(2,4))];
            w1=liefeng1(M(3),cs,d,AA03(2,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA03(2,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;              
            
        elseif A1(2,5)>AA03(2,5) && A1(2,5)<=AA03(3,5)
            A1(2,3)=AA03(3,3);
            A1(2,4)=AA03(3,4);
            A1(2,5)=AA03(3,5);
            d=[AA03(3,1) fix(1000/AA03(3,2)) AA03(3,3) fix(1000/AA03(3,4))];
            w1=liefeng1(M(3),cs,d,AA03(3,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA03(3,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(2,1) fix(1000/AA03(2,2)) AA03(2,3) fix(1000/AA03(2,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(2,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(2,5),h(2),C,rg); 
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA03(2,3);
                 A1(2,4)=AA03(2,4);
                 A1(2,5)=AA03(2,5);
                 A1(2,6)=ww;
            end                       
            
            
        elseif A1(2,5)>AA03(3,5) && A1(2,5)<=AA03(4,5)
            A1(2,3)=AA03(4,3);
            A1(2,4)=AA03(4,4);
            A1(2,5)=AA03(4,5);
            d=[AA03(4,1) fix(1000/AA03(4,2)) AA03(4,3) fix(1000/AA03(4,4))];
            w1=liefeng1(M(3),cs,d,AA03(4,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA03(4,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(3,1) fix(1000/AA03(3,2)) AA03(3,3) fix(1000/AA03(3,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(3,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(3,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA03(3,3);
                 A1(2,4)=AA03(3,4);
                 A1(2,5)=AA03(3,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA03(4,5) && A1(2,5)<=AA03(5,5)
            A1(2,3)=AA03(5,3);
            A1(2,4)=AA03(5,4);
            A1(2,5)=AA03(5,5);
            d=[AA03(5,1) fix(1000/AA03(5,2)) AA03(5,3) fix(1000/AA03(5,4))];
            w1=liefeng1(M(3),cs,d,AA03(5,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA03(5,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(4,1) fix(1000/AA03(4,2)) AA03(4,3) fix(1000/AA03(4,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(4,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(4,5),h(2),C,rg); 
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA03(4,3);
                 A1(2,4)=AA03(4,4);
                 A1(2,5)=AA03(4,5);
                 A1(2,6)=ww;
            end            
                        
        elseif A1(2,5)>AA03(5,5) && A1(2,5)<=AA03(6,5)
            A1(2,3)=AA03(6,3);
            A1(2,4)=AA03(6,4);
            A1(2,5)=AA03(6,5);
            d=[AA03(6,1) fix(1000/AA03(6,2)) AA03(6,3) fix(1000/AA03(6,4))];
            w1=liefeng1(M(3),cs,d,AA03(6,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA03(6,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(5,1) fix(1000/AA03(5,2)) AA03(5,3) fix(1000/AA03(5,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(5,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(5,5),h(2),C,rg);
            ww=max(ww1,ww2);
            
            if ww<=0.2
                 A1(2,3)=AA03(5,3);
                 A1(2,4)=AA03(5,4);
                 A1(2,5)=AA03(5,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA03(6,5) && A1(2,5)<=AA03(7,5)
            A1(2,3)=AA03(7,3);
            A1(2,4)=AA03(7,4);
            A1(2,5)=AA03(7,5);
            d=[AA03(7,1) fix(1000/AA03(7,2)) AA03(7,3) fix(1000/AA03(7,4))];
            w1=liefeng1(M(3),cs,d,AA03(7,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA03(7,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(6,1) fix(1000/AA03(6,2)) AA03(6,3) fix(1000/AA03(6,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(6,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(6,5),h(2),C,rg);
            ww=max(ww1,ww2);
            
            if ww<=0.2
                 A1(2,3)=AA03(6,3);
                 A1(2,4)=AA03(6,4);
                 A1(2,5)=AA03(6,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA03(7,5) && A1(2,5)<=AA03(8,5)
            A1(2,3)=AA03(8,3); 
            A1(2,4)=AA03(8,4);
            A1(2,5)=AA03(8,5);
            d=[AA03(8,1) fix(1000/AA03(8,2)) AA03(8,3) fix(1000/AA03(8,4))];
            w1=liefeng1(M(3),cs,d,AA03(8,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA03(8,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(7,1) fix(1000/AA03(7,2)) AA03(7,3) fix(1000/AA03(7,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(7,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(7,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA03(7,3);
                 A1(2,4)=AA03(7,4);
                 A1(2,5)=AA03(7,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA03(8,5) && A1(2,5)<=AA03(9,5)
            A1(2,3)=AA03(9,3);
            A1(2,4)=AA03(9,4);
            A1(2,5)=AA03(9,5);
            d=[AA03(9,1) fix(1000/AA03(9,2)) AA03(9,3) fix(1000/AA03(9,4))];
            w1=liefeng1(M(3),cs,d,AA03(9,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA03(9,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(8,1) fix(1000/AA03(8,2)) AA03(8,3) fix(1000/AA03(8,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(8,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(8,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA03(8,3);
                 A1(2,4)=AA03(8,4);
                 A1(2,5)=AA03(8,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA03(9,5) && A1(2,5)<=AA03(10,5)
            A1(2,3)=AA03(10,3);
            A1(2,4)=AA03(10,4);
            A1(2,5)=AA03(10,5);
            d=[AA03(10,1) fix(1000/AA03(10,2)) AA03(10,3) fix(1000/AA03(10,4))];
            w1=liefeng1(M(3),cs,d,AA03(10,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA03(10,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(9,1) fix(1000/AA03(9,2)) AA03(9,3) fix(1000/AA03(9,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(9,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(9,5),h(2),C,rg);
            ww=max(ww1,ww2);            
            if ww<=0.2
                 A1(2,3)=AA03(9,3);
                 A1(2,4)=AA03(9,4);
                 A1(2,5)=AA03(9,5);
                 A1(2,6)=ww;
            end              
            
        elseif A1(2,5)>AA03(10,5) && A1(2,5)<=AA03(11,5)
            A1(2,3)=AA03(11,3); 
            A1(2,4)=AA03(11,4);
            A1(2,5)=AA03(11,5);
            d=[AA03(11,1) fix(1000/AA03(11,2)) AA03(11,3) fix(1000/AA03(11,4))];
            w1=liefeng1(M(3),cs,d,AA03(11,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA03(11,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(10,1) fix(1000/AA03(10,2)) AA03(10,3) fix(1000/AA03(10,4))];
            ww1=liefeng1(M(3),cs,dd,AA03(10,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA03(10,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA03(10,3);
                 A1(2,4)=AA03(10,4);
                 A1(2,5)=AA03(10,5);
                 A1(2,6)=ww;
            end                
        end             
    A=A1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%        

   elseif A1(1,1)==18
        if A1(2,5)<=AA04(2,5)
            A1(2,3)=AA04(2,3);
            A1(2,4)=AA04(2,4);
            A1(2,5)=AA04(2,5);
            d=[AA04(2,1) fix(1000/AA04(2,2)) AA04(2,3) fix(1000/AA04(2,4))];
            w1=liefeng1(M(3),cs,d,AA04(2,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(2,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
            
        elseif A1(2,5)>AA04(2,5) && A1(2,5)<=AA04(3,5)
            A1(2,3)=AA04(3,3);
            A1(2,4)=AA04(3,4);
            A1(2,5)=AA04(3,5);
            d=[AA04(3,1) fix(1000/AA04(3,2)) AA04(3,3) fix(1000/AA04(3,4))];
            w1=liefeng1(M(3),cs,d,AA04(3,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(3,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(2,1) fix(1000/AA04(2,2)) AA04(2,3) fix(1000/AA04(2,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(2,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(2,5),h(2),C,rg); 
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(2,3);
                 A1(2,4)=AA04(2,4);
                 A1(2,5)=AA04(2,5);
                 A1(2,6)=ww;
            end
            
        elseif A1(2,5)>AA04(3,5) && A1(2,5)<=AA04(4,5)
            A1(2,3)=AA04(4,3);
            A1(2,4)=AA04(4,4);
            A1(2,5)=AA04(4,5);
            d=[AA04(4,1) fix(1000/AA04(4,2)) AA04(4,3) fix(1000/AA04(4,4))];
            w1=liefeng1(M(3),cs,d,AA04(4,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(4,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(3,1) fix(1000/AA04(3,2)) AA04(3,3) fix(1000/AA04(3,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(3,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(3,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(3,3);
                 A1(2,4)=AA04(3,4);
                 A1(2,5)=AA04(3,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA04(4,5) && A1(2,5)<=AA04(5,5)
            A1(2,3)=AA04(5,3);
            A1(2,4)=AA04(5,4);
            A1(2,5)=AA04(5,5);
            d=[AA04(5,1) fix(1000/AA04(5,2)) AA04(5,3) fix(1000/AA04(5,4))];
            w1=liefeng1(M(3),cs,d,AA04(5,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(5,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(4,1) fix(1000/AA04(4,2)) AA04(4,3) fix(1000/AA04(4,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(4,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(4,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(4,3);
                 A1(2,4)=AA04(4,4);
                 A1(2,5)=AA04(4,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA04(5,5) && A1(2,5)<=AA04(6,5)
            A1(2,3)=AA04(6,3);
            A1(2,4)=AA04(6,4);
            A1(2,5)=AA04(6,5);
            d=[AA04(6,1) fix(1000/AA04(6,2)) AA04(6,3) fix(1000/AA04(6,4))];
            w1=liefeng1(M(3),cs,d,AA04(6,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA04(6,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(5,1) fix(1000/AA04(5,2)) AA04(5,3) fix(1000/AA04(5,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(5,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(5,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(5,3);
                 A1(2,4)=AA04(5,4);
                 A1(2,5)=AA04(5,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA04(6,5) && A1(2,5)<=AA04(7,5)
            A1(2,3)=AA04(7,3);
            A1(2,4)=AA04(7,4);
            A1(2,5)=AA04(7,5);
            d=[AA04(7,1) fix(1000/AA04(7,2)) AA04(7,3) fix(1000/AA04(7,4))];
            w1=liefeng1(M(3),cs,d,AA04(7,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(7,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(6,1) fix(1000/AA04(6,2)) AA04(6,3) fix(1000/AA04(6,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(6,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(6,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(6,3);
                 A1(2,4)=AA04(6,4);
                 A1(2,5)=AA04(6,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA04(7,5) && A1(2,5)<=AA04(8,5)
            A1(2,3)=AA04(8,3);
            A1(2,4)=AA04(8,4);
            A1(2,5)=AA04(8,5);
            d=[AA04(8,1) fix(1000/AA04(8,2)) AA04(8,3) fix(1000/AA04(8,4))];
            w1=liefeng1(M(3),cs,d,AA04(8,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA04(8,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(7,1) fix(1000/AA04(7,2)) AA04(7,3) fix(1000/AA04(7,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(7,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(7,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(7,3);
                 A1(2,4)=AA04(7,4);
                 A1(2,5)=AA04(7,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA04(8,5) && A1(2,5)<=AA04(9,5)
            A1(2,3)=AA04(9,3);
            A1(2,4)=AA04(9,4);
            A1(2,5)=AA04(9,5);
            d=[AA04(9,1) fix(1000/AA04(9,2)) AA04(9,3) fix(1000/AA04(9,4))];
            w1=liefeng1(M(3),cs,d,AA04(9,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(9,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(8,1) fix(1000/AA04(8,2)) AA04(8,3) fix(1000/AA04(8,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(8,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(8,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(8,3);
                 A1(2,4)=AA04(8,4);
                 A1(2,5)=AA04(8,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA04(9,5) && A1(2,5)<=AA04(10,5)
            A1(2,3)=AA04(10,3);
            A1(2,4)=AA04(10,4);
            A1(2,5)=AA04(10,5);
            d=[AA04(10,1) fix(1000/AA04(10,2)) AA04(10,3) fix(1000/AA04(10,4))];
            w1=liefeng1(M(3),cs,d,AA04(10,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(10,5),h(2),C,rg);
            w=max(w1,w2); 
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(9,1) fix(1000/AA04(9,2)) AA04(9,3) fix(1000/AA04(9,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(9,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(9,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(9,3);
                 A1(2,4)=AA04(9,4);
                 A1(2,5)=AA04(9,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA04(10,5) && A1(2,5)<=AA04(11,5)
            A1(2,3)=AA04(11,3);
            A1(2,4)=AA04(11,4);
            A1(2,5)=AA04(11,5);
            d=[AA04(11,1) fix(1000/AA04(11,2)) AA04(11,3) fix(1000/AA04(11,4))];
            w1=liefeng1(M(3),cs,d,AA04(11,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA04(11,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(10,1) fix(1000/AA04(10,2)) AA04(10,3) fix(1000/AA04(10,4))];
            ww1=liefeng1(M(3),cs,dd,AA04(10,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA04(10,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA04(10,3);
                 A1(2,4)=AA04(10,4);
                 A1(2,5)=AA04(10,5);
                 A1(2,6)=ww;
            end                      
        end              
    A=A1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%                 
        elseif A1(1,1)==20
        if A1(2,5)<=AA05(2,5)
            A1(2,3)=AA05(2,3);
            A1(2,4)=AA05(2,4);
            A1(2,5)=AA05(2,5);
            d=[AA05(2,1) fix(1000/AA05(2,2)) AA05(2,3) fix(1000/AA05(2,4))];
            w1=liefeng1(M(3),cs,d,AA05(2,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(2,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w;             
            
        elseif A1(2,5)>AA05(2,5) && A1(2,5)<=AA05(3,5)
            A1(2,3)=AA05(3,3);
            A1(2,4)=AA05(3,4);
            A1(2,5)=AA05(3,5);
            d=[AA05(3,1) fix(1000/AA05(3,2)) AA05(3,3) fix(1000/AA05(3,4))];
            w1=liefeng1(M(3),cs,d,AA05(3,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(3,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(2,1) fix(1000/AA05(2,2)) AA05(2,3) fix(1000/AA05(2,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(2,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(2,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(2,3);
                 A1(2,4)=AA05(2,4);
                 A1(2,5)=AA05(2,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA05(3,5) && A1(2,5)<=AA05(4,5)
            A1(2,3)=AA05(4,3);
            A1(2,4)=AA05(4,4);
            A1(2,5)=AA05(4,5);
            d=[AA05(4,1) fix(1000/AA05(4,2)) AA05(4,3) fix(1000/AA05(4,4))];
            w1=liefeng1(M(3),cs,d,AA05(4,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(4,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(3,1) fix(1000/AA05(3,2)) AA05(3,3) fix(1000/AA05(3,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(3,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(3,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(3,3);
                 A1(2,4)=AA05(3,4);
                 A1(2,5)=AA05(3,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA05(4,5) && A1(2,5)<=AA05(5,5)
            A1(2,3)=AA05(5,3);
            A1(2,4)=AA05(5,4);
            A1(2,5)=AA05(5,5);
            d=[AA05(5,1) fix(1000/AA05(5,2)) AA05(5,3) fix(1000/AA05(5,4))];
            w1=liefeng1(M(3),cs,d,AA05(5,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(5,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(4,1) fix(1000/AA05(4,2)) AA05(4,3) fix(1000/AA05(4,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(4,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(4,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(4,3);
                 A1(2,4)=AA05(4,4);
                 A1(2,5)=AA05(4,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA05(5,5) && A1(2,5)<=AA05(6,5)
            A1(2,3)=AA05(6,3);
            A1(2,4)=AA05(6,4);
            A1(2,5)=AA05(6,5);
            d=[AA05(6,1) fix(1000/AA05(6,2)) AA05(6,3) fix(1000/AA05(6,4))];
            w1=liefeng1(M(3),cs,d,AA05(6,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(6,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(5,1) fix(1000/AA05(5,2)) AA05(5,3) fix(1000/AA05(5,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(5,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(5,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(5,3);
                 A1(2,4)=AA05(5,4);
                 A1(2,5)=AA05(5,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA05(6,5) && A1(2,5)<=AA05(7,5)
            A1(2,3)=AA05(7,3);
            A1(2,4)=AA05(7,4);
            A1(2,5)=AA05(7,5);
            d=[AA05(7,1) fix(1000/AA05(7,2)) AA05(7,3) fix(1000/AA05(7,4))];
            w1=liefeng1(M(3),cs,d,AA05(7,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA05(7,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(6,1) fix(1000/AA05(6,2)) AA05(6,3) fix(1000/AA05(6,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(6,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(6,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(6,3);
                 A1(2,4)=AA05(6,4);
                 A1(2,5)=AA05(6,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA05(7,5) && A1(2,5)<=AA05(8,5)
            A1(2,3)=AA05(8,3);
            A1(2,4)=AA05(8,4);
            A1(2,5)=AA05(8,5);
            d=[AA05(8,1) fix(1000/AA05(8,2)) AA05(8,3) fix(1000/AA05(8,4))];
            w1=liefeng1(M(3),cs,d,AA05(8,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(8,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(7,1) fix(1000/AA05(7,2)) AA05(7,3) fix(1000/AA05(7,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(7,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(7,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(7,3);
                 A1(2,4)=AA05(7,4);
                 A1(2,5)=AA05(7,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA05(8,5) && A1(2,5)<=AA05(9,5)
            A1(2,3)=AA05(9,3);
            A1(2,4)=AA05(9,4);
            A1(2,5)=AA05(9,5);
            d=[AA05(9,1) fix(1000/AA05(9,2)) AA05(9,3) fix(1000/AA05(9,4))];
            w1=liefeng1(M(3),cs,d,AA05(9,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(9,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(8,1) fix(1000/AA05(8,2)) AA05(8,3) fix(1000/AA05(8,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(8,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(8,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(8,3);
                 A1(2,4)=AA05(8,4);
                 A1(2,5)=AA05(8,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA05(9,5) && A1(2,5)<=AA05(10,5)
            A1(2,3)=AA05(10,3);
            A1(2,4)=AA05(10,4);
            A1(2,5)=AA05(10,5);
            d=[AA05(10,1) fix(1000/AA05(10,2)) AA05(10,3) fix(1000/AA05(10,4))];
            w1=liefeng1(M(3),cs,d,AA05(10,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA05(10,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(9,1) fix(1000/AA05(9,2)) AA05(9,3) fix(1000/AA05(9,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(9,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(9,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA05(9,3);
                 A1(2,4)=AA05(9,4);
                 A1(2,5)=AA05(9,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA05(10,5) && A1(2,5)<=AA05(11,5)
            A1(2,3)=AA05(11,3); 
            A1(2,4)=AA05(11,4);
            A1(2,5)=AA05(11,5);
            d=[AA05(11,1) fix(1000/AA05(11,2)) AA05(11,3) fix(1000/AA05(11,4))];
            w1=liefeng1(M(3),cs,d,AA05(11,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA05(11,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w; 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(10,1) fix(1000/AA05(10,2)) AA05(10,3) fix(1000/AA05(10,4))];
            ww1=liefeng1(M(3),cs,dd,AA05(10,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA05(10,5),h(2),C,rg);
            ww=max(ww1,ww2); 
            if ww<=0.2
                 A1(2,3)=AA05(10,3);
                 A1(2,4)=AA05(10,4);
                 A1(2,5)=AA05(10,5);
                 A1(2,6)=ww;
            end                
        end              
     A=A1;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%     
    elseif A1(1,1)==22
        if A1(2,5)<=AA06(2,5)
            A1(2,3)=AA06(2,3);
            A1(2,4)=AA06(2,4);
            A1(2,5)=AA06(2,5);
            d=[AA06(2,1) fix(1000/AA06(2,2)) AA06(2,3) fix(1000/AA06(2,4))];
            w1=liefeng1(M(3),cs,d,AA06(2,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA06(2,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;             
            
        elseif A1(2,5)>AA06(2,5) && A1(2,5)<=AA06(3,5)
            A1(2,3)=AA06(3,3);
            A1(2,4)=AA06(3,4);
            A1(2,5)=AA06(3,5);
            d=[AA06(3,1) fix(1000/AA06(3,2)) AA06(3,3) fix(1000/AA06(3,4))];
            w1=liefeng1(M(3),cs,d,AA06(3,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA06(3,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(2,1) fix(1000/AA06(2,2)) AA06(2,3) fix(1000/AA06(2,4))];
            ww1=liefeng1(M(3),cs,dd,AA06(2,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA06(2,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA06(2,3);
                 A1(2,4)=AA06(2,4);
                 A1(2,5)=AA06(2,5);
                 A1(2,6)=ww;
            end            
 
        elseif A1(2,5)>AA06(3,5) && A1(2,5)<=AA06(4,5)
            A1(2,3)=AA06(4,3);
            A1(2,4)=AA06(4,4);
            A1(2,5)=AA06(4,5);
            d=[AA06(4,1) fix(1000/AA06(4,2)) AA06(4,3) fix(1000/AA06(4,4))];
            w1=liefeng1(M(3),cs,d,AA06(4,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA06(4,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(3,1) fix(1000/AA06(3,2)) AA06(3,3) fix(1000/AA06(3,4))];
            ww1=liefeng1(M(3),cs,dd,AA06(3,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA06(3,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA06(3,3);
                 A1(2,4)=AA06(3,4);
                 A1(2,5)=AA06(3,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA06(4,5) && A1(2,5)<=AA06(5,5)
            A1(2,3)=AA06(5,3);
            A1(2,4)=AA06(5,4);
            A1(2,5)=AA06(5,5);
            d=[AA06(5,1) fix(1000/AA06(5,2)) AA06(5,3) fix(1000/AA06(5,4))];
            w1=liefeng1(M(3),cs,d,AA06(5,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA06(5,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(4,1) fix(1000/AA06(4,2)) AA06(4,3) fix(1000/AA06(4,4))];
            ww1=liefeng1(M(3),cs,dd,AA06(4,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA06(4,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA06(4,3);
                 A1(2,4)=AA06(4,4);
                 A1(2,5)=AA06(4,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA06(5,5) && A1(2,5)<=AA06(6,5)
            A1(2,3)=AA06(6,3);
            A1(2,4)=AA06(6,4);
            A1(2,5)=AA06(6,5);
            d=[AA06(6,1) fix(1000/AA06(6,2)) AA06(6,3) fix(1000/AA06(6,4))];
            w1=liefeng1(M(3),cs,d,AA06(6,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA06(6,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(5,1) fix(1000/AA06(5,2)) AA06(5,3) fix(1000/AA06(5,4))];
            ww1=liefeng1(M(3),cs,dd,AA06(5,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA06(5,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA06(5,3);
                 A1(2,4)=AA06(5,4);
                 A1(2,5)=AA06(5,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA06(6,5) && A1(2,5)<=AA06(7,5)
            A1(2,3)=AA06(7,3);
            A1(2,4)=AA06(7,4);
            A1(2,5)=AA06(7,5);
            d=[AA06(7,1) fix(1000/AA06(7,2)) AA06(7,3) fix(1000/AA06(7,4))];
            w1=liefeng1(M(3),cs,d,AA06(7,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA06(7,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(6,1) fix(1000/AA06(6,2)) AA06(6,3) fix(1000/AA06(6,4))];
            ww1=liefeng1(M(3),cs,dd,AA06(6,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA06(6,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA06(6,3);
                 A1(2,4)=AA06(6,4);
                 A1(2,5)=AA06(6,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA06(7,5) && A1(2,5)<=AA06(8,5)
            A1(2,3)=AA06(8,3);
            A1(2,4)=AA06(8,4);
            A1(2,5)=AA06(8,5);
            d=[AA06(8,1) fix(1000/AA06(8,2)) AA06(8,3) fix(1000/AA06(8,4))];
            w1=liefeng1(M(3),cs,d,AA06(8,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA06(8,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(7,1) fix(1000/AA06(7,2)) AA06(7,3) fix(1000/AA06(7,4))];
            ww1=liefeng1(M(3),cs,dd,AA06(7,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA06(7,5),h(2),C,rg); 
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA06(7,3);
                 A1(2,4)=AA06(7,4);
                 A1(2,5)=AA06(7,5);
                 A1(2,6)=ww;
            end             
            
        elseif A1(2,5)>AA06(8,5) && A1(2,5)<=AA06(9,5)
            A1(2,3)=AA06(9,3);
            A1(2,4)=AA06(9,4);
            A1(2,5)=AA06(9,5);
            d=[AA06(9,1) fix(1000/AA06(9,2)) AA06(9,3) fix(1000/AA06(9,4))];
            w1=liefeng1(M(3),cs,d,AA06(9,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA06(9,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(8,1) fix(1000/AA06(8,2)) AA06(8,3) fix(1000/AA06(8,4))];
            ww1=liefeng1(M(3),cs,dd,AA06(8,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA06(8,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA06(8,3);
                 A1(2,4)=AA06(8,4);
                 A1(2,5)=AA06(8,5);
                 A1(2,6)=ww;
            end               
        end            
    A=A1;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%    
    elseif A1(1,1)==25
        if A1(2,5)<=AA07(2,5)
            A1(2,3)=AA07(2,3);
            A1(2,4)=AA07(2,4);
            A1(2,5)=AA07(2,5);
            d=[AA07(2,1) fix(1000/AA07(2,2)) AA07(2,3) fix(1000/AA07(2,4))];
            w1=liefeng1(M(3),cs,d,AA07(2,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA07(2,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w;            
            
        elseif A1(2,5)>AA07(2,5) && A1(2,5)<=AA07(3,5)
            A1(2,3)=AA07(3,3);
            A1(2,4)=AA07(3,4);
            A1(2,5)=AA07(3,5);
            d=[AA07(3,1) fix(1000/AA07(3,2)) AA07(3,3) fix(1000/AA07(3,4))];
            w1=liefeng1(M(3),cs,d,AA07(3,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA07(3,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(2,1) fix(1000/AA07(2,2)) AA07(2,3) fix(1000/AA07(2,4))];
            ww1=liefeng1(M(3),cs,dd,AA07(2,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA07(2,5),h(2),C,rg); 
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA07(2,3);
                 A1(2,4)=AA07(2,4);
                 A1(2,5)=AA07(2,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA07(3,5) && A1(2,5)<=AA07(4,5)
            A1(2,3)=AA07(4,3);
            A1(2,4)=AA07(4,4);
            A1(2,5)=AA07(4,5);
            d=[AA07(4,1) fix(1000/AA07(4,2)) AA07(4,3) fix(1000/AA07(4,4))];
            w1=liefeng1(M(3),cs,d,AA07(4,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA07(4,5),h(2),C,rg); 
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(3,1) fix(1000/AA07(3,2)) AA07(3,3) fix(1000/AA07(3,4))];
            ww1=liefeng1(M(3),cs,dd,AA07(3,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA07(3,5),h(2),C,rg); 
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA07(3,3);
                 A1(2,4)=AA07(3,4);
                 A1(2,5)=AA07(3,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA07(4,5) && A1(2,5)<=AA07(5,5)
            A1(2,3)=AA07(5,3);
            A1(2,4)=AA07(5,4);
            A1(2,5)=AA07(5,5);
            d=[AA07(5,1) fix(1000/AA07(5,2)) AA07(5,3) fix(1000/AA07(5,4))];
            w1=liefeng1(M(3),cs,d,AA07(5,5),h(1),C,rg); 
            w2=liefeng1(M(3),cs,d,AA07(5,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(4,1) fix(1000/AA07(4,2)) AA07(4,3) fix(1000/AA07(4,4))];
            ww1=liefeng1(M(3),cs,dd,AA07(4,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA07(4,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA07(4,3);
                 A1(2,4)=AA07(4,4);
                 A1(2,5)=AA07(4,5);
                 A1(2,6)=ww;
            end            
                        
        elseif A1(2,5)>AA07(5,5) && A1(2,5)<=AA07(6,5)
            A1(2,3)=AA07(6,3);
            A1(2,4)=AA07(6,4);
            A1(2,5)=AA07(6,5);
            d=[AA07(6,1) fix(1000/AA07(6,2)) AA07(6,3) fix(1000/AA07(6,4))];
            w1=liefeng1(M(3),cs,d,AA07(6,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA07(6,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(5,1) fix(1000/AA07(5,2)) AA07(5,3) fix(1000/AA07(5,4))];
            ww1=liefeng1(M(3),cs,dd,AA07(5,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA07(5,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA07(5,3);
                 A1(2,4)=AA07(5,4);
                 A1(2,5)=AA07(5,5);
                 A1(2,6)=ww;
            end            
            
        elseif A1(2,5)>AA07(6,5) && A1(2,5)<=AA07(7,5)
            A1(2,3)=AA07(7,3); 
            A1(2,4)=AA07(7,4);
            A1(2,5)=AA07(7,5);
            d=[AA07(7,1) fix(1000/AA07(7,2)) AA07(7,3) fix(1000/AA07(7,4))];
            w1=liefeng1(M(3),cs,d,AA07(7,5),h(1),C,rg);
            w2=liefeng1(M(3),cs,d,AA07(7,5),h(2),C,rg);
            w=max(w1,w2);
            A1(2,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(6,1) fix(1000/AA07(6,2)) AA07(6,3) fix(1000/AA07(6,4))];
            ww1=liefeng1(M(3),cs,dd,AA07(6,5),h(1),C,rg);                   %M（2）为B点的弯矩
            ww2=liefeng1(M(3),cs,dd,AA07(6,5),h(2),C,rg);
            ww=max(ww1,ww2);
            if ww<=0.2
                 A1(2,3)=AA07(6,3);
                 A1(2,4)=AA07(6,4);
                 A1(2,5)=AA07(6,5);
                 A1(2,6)=ww;
            end                        
        end            
    A=A1;                  
    end    
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%A1(2,1)>A1(1,1) 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
else
    A1(1,1)=A1(2,1);
    if A1(2,1)==12
        if A1(1,5)<=AA01(2,5)
            A1(1,3)=AA01(2,3);
            A1(1,4)=AA01(2,4);
            A1(1,5)=AA01(2,5);
            d=[AA01(2,1) fix(1000/AA01(2,2)) AA01(2,3) fix(1000/AA01(2,4))];
            w=liefeng1(M(1),cs,d,AA01(2,5),h(1),C,rg); 
            A1(1,6)=w;             
            
        elseif A1(1,5)>AA01(2,5) && A1(1,5)<=AA01(3,5)
            A1(1,3)=AA01(3,3);
            A1(1,4)=AA01(3,4);
            A1(1,5)=AA01(3,5);
            d=[AA01(3,1) fix(1000/AA01(3,2)) AA01(3,3) fix(1000/AA01(3,4))];
            w=liefeng1(M(1),cs,d,AA01(3,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(2,1) fix(1000/AA01(2,2)) AA01(2,3) fix(1000/AA01(2,4))];
            ww=liefeng1(M(1),cs,dd,AA01(2,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA01(2,3);
                 A1(1,4)=AA01(2,4);
                 A1(1,5)=AA01(2,5);
                 A1(1,6)=ww;
            end             
                       
        elseif A1(1,5)>AA01(3,5) && A1(1,5)<=AA01(4,5)
            A1(1,3)=AA01(4,3);
            A1(1,4)=AA01(4,4);
            A1(1,5)=AA01(4,5);
            d=[AA01(4,1) fix(1000/AA01(4,2)) AA01(4,3) fix(1000/AA01(4,4))];
            w=liefeng1(M(1),cs,d,AA01(4,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(3,1) fix(1000/AA01(3,2)) AA01(3,3) fix(1000/AA01(3,4))];
            ww=liefeng1(M(1),cs,dd,AA01(3,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA01(3,3);
                 A1(1,4)=AA01(3,4);
                 A1(1,5)=AA01(3,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA01(4,5) && A1(1,5)<=AA01(5,5)
            A1(1,3)=AA01(5,3);
            A1(1,4)=AA01(5,4);
            A1(1,5)=AA01(5,5);
            d=[AA01(5,1) fix(1000/AA01(5,2)) AA01(5,3) fix(1000/AA01(5,4))];
            w=liefeng1(M(1),cs,d,AA01(5,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(4,1) fix(1000/AA01(4,2)) AA01(4,3) fix(1000/AA01(4,4))];
            ww=liefeng1(M(1),cs,dd,AA01(4,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA01(4,3);
                 A1(1,4)=AA01(4,4);
                 A1(1,5)=AA01(4,5);
                 A1(1,6)=ww;
            end            
                        
        elseif A1(1,5)>AA01(5,5) && A1(1,5)<=AA01(6,5)
            A1(1,3)=AA01(6,3);
            A1(1,4)=AA01(6,4);
            A1(1,5)=AA01(6,5);
            d=[AA01(6,1) fix(1000/AA01(6,2)) AA01(6,3) fix(1000/AA01(6,4))];
            w=liefeng1(M(1),cs,d,AA01(6,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(5,1) fix(1000/AA01(5,2)) AA01(5,3) fix(1000/AA01(5,4))];
            ww=liefeng1(M(1),cs,dd,AA01(5,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA01(5,3);
                 A1(1,4)=AA01(5,4);
                 A1(1,5)=AA01(5,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA01(6,5) && A1(1,5)<=AA01(7,5)
            A1(1,3)=AA01(7,3);
            A1(1,4)=AA01(7,4);
            A1(1,5)=AA01(7,5);
            d=[AA01(7,1) fix(1000/AA01(7,2)) AA01(7,3) fix(1000/AA01(7,4))];
            w=liefeng1(M(1),cs,d,AA01(7,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA01(6,1) fix(1000/AA01(6,2)) AA01(6,3) fix(1000/AA01(6,4))];
            ww=liefeng1(M(1),cs,dd,AA01(6,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA01(6,3);
                 A1(1,4)=AA01(6,4);
                 A1(1,5)=AA01(6,5);
                 A1(1,6)=ww;
            end                        
        end
   A=A1;
 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%       
   elseif A1(2,1)==14
        if A1(1,5)<=AA02(2,5)
            A1(1,3)=AA02(2,3);
            A1(1,4)=AA02(2,4);
            A1(1,5)=AA02(2,5);
            d=[AA02(2,1) fix(1000/AA02(2,2)) AA02(2,3) fix(1000/AA02(2,4))];
            w=liefeng1(M(1),cs,d,AA02(2,5),h(1),C,rg); 
            A1(1,6)=w;            
            
        elseif A1(1,5)>AA02(2,5) && A1(1,5)<=AA02(3,5)
            A1(1,3)=AA02(3,3);
            A1(1,4)=AA02(3,4);
            A1(1,5)=AA02(3,5);
            d=[AA02(3,1) fix(1000/AA02(3,2)) AA02(3,3) fix(1000/AA02(3,4))];
            w=liefeng1(M(1),cs,d,AA02(3,5),h(1),C,rg); 
            A1(1,6)=w;  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(2,1) fix(1000/AA02(2,2)) AA02(2,3) fix(1000/AA02(2,4))];
            ww=liefeng1(M(1),cs,dd,AA02(2,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA02(2,3);
                 A1(1,4)=AA02(2,4);
                 A1(1,5)=AA02(2,5);
                 A1(1,6)=ww;
            end             
                       
        elseif A1(1,5)>AA02(3,5) && A1(1,5)<=AA02(4,5)
            A1(1,3)=AA02(4,3);
            A1(1,4)=AA02(4,4);
            A1(1,5)=AA02(4,5);
            d=[AA02(4,1) fix(1000/AA02(4,2)) AA02(4,3) fix(1000/AA02(4,4))];
            w=liefeng1(M(1),cs,d,AA02(4,5),h(1),C,rg); 
            A1(1,6)=w;  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(3,1) fix(1000/AA02(3,2)) AA02(3,3) fix(1000/AA02(3,4))];
            ww=liefeng1(M(1),cs,dd,AA02(3,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA02(3,3);
                 A1(1,4)=AA02(3,4);
                 A1(1,5)=AA02(3,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA02(4,5) && A1(1,5)<=AA02(5,5)
            A1(1,3)=AA02(5,3);
            A1(1,4)=AA02(5,4);
            A1(1,5)=AA02(5,5);
            d=[AA02(5,1) fix(1000/AA02(5,2)) AA02(5,3) fix(1000/AA02(5,4))];
            w=liefeng1(M(1),cs,d,AA02(5,5),h(1),C,rg); 
            A1(1,6)=w;  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(4,1) fix(1000/AA02(4,2)) AA02(4,3) fix(1000/AA02(4,4))];
            ww=liefeng1(M(1),cs,dd,AA02(4,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA02(4,3);
                 A1(1,4)=AA02(4,4);
                 A1(1,5)=AA02(4,5);
                 A1(1,6)=ww;
            end            
                    
        elseif A1(1,5)>AA02(5,5) && A1(1,5)<=AA02(6,5)
            A1(1,3)=AA02(6,3);
            A1(1,4)=AA02(6,4);
            A1(1,5)=AA02(6,5);
            d=[AA02(6,1) fix(1000/AA02(6,2)) AA02(6,3) fix(1000/AA02(6,4))];
            w=liefeng1(M(1),cs,d,AA02(6,5),h(1),C,rg); 
            A1(1,6)=w;  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(5,1) fix(1000/AA02(5,2)) AA02(5,3) fix(1000/AA02(5,4))];
            ww=liefeng1(M(1),cs,dd,AA02(5,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA02(5,3);
                 A1(1,4)=AA02(5,4);
                 A1(1,5)=AA02(5,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA02(6,5) && A1(1,5)<=AA02(7,5)
            A1(1,3)=AA02(7,3);
            A1(1,4)=AA02(7,4);
            A1(1,5)=AA02(7,5);
            d=[AA02(7,1) fix(1000/AA02(7,2)) AA02(7,3) fix(1000/AA02(7,4))];
            w=liefeng1(M(1),cs,d,AA02(7,5),h(1),C,rg); 
            A1(1,6)=w;  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(6,1) fix(1000/AA02(6,2)) AA02(6,3) fix(1000/AA02(6,4))];
            ww=liefeng1(M(1),cs,dd,AA02(6,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA02(6,3);
                 A1(1,4)=AA02(6,4);
                 A1(1,5)=AA02(6,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA02(7,5) && A1(1,5)<=AA02(8,5)
            A1(1,3)=AA02(8,3);
            A1(1,4)=AA02(8,4);
            A1(1,5)=AA02(8,5);
            d=[AA02(8,1) fix(1000/AA02(8,2)) AA02(8,3) fix(1000/AA02(8,4))];
            w=liefeng1(M(1),cs,d,AA02(8,5),h(1),C,rg); 
            A1(1,6)=w;  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(7,1) fix(1000/AA02(7,2)) AA02(7,3) fix(1000/AA02(7,4))];
            ww=liefeng1(M(1),cs,dd,AA02(7,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA02(7,3);
                 A1(1,4)=AA02(7,4);
                 A1(1,5)=AA02(7,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA02(8,5) && A1(1,5)<=AA02(9,5)
            A1(1,3)=AA02(9,3);
            A1(1,4)=AA02(9,4);
            A1(1,5)=AA02(9,5);
            d=[AA02(9,1) fix(1000/AA02(9,2)) AA02(9,3) fix(1000/AA02(9,4))];
            w=liefeng1(M(1),cs,d,AA02(9,5),h(1),C,rg); 
            A1(1,6)=w;  
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA02(8,1) fix(1000/AA02(8,2)) AA02(8,3) fix(1000/AA02(8,4))];
            ww=liefeng1(M(1),cs,dd,AA02(8,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA02(8,3);
                 A1(1,4)=AA02(8,4);
                 A1(1,5)=AA02(8,5);
                 A1(1,6)=ww;
            end                      
        end 
   A=A1;
 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%       
   elseif A1(2,1)==16
        if A1(1,5)<=AA03(2,5)
            A1(1,3)=AA03(2,3);
            A1(1,4)=AA03(2,4);
            A1(1,5)=AA03(2,5);
            d=[AA03(2,1) fix(1000/AA03(2,2)) AA03(2,3) fix(1000/AA03(2,4))];
            w=liefeng1(M(1),cs,d,AA03(2,5),h(1),C,rg); 
            A1(1,6)=w;             
                        
        elseif A1(1,5)>AA03(2,5) && A1(1,5)<=AA03(3,5)
            A1(1,3)=AA03(3,3);
            A1(1,4)=AA03(3,4);
            A1(1,5)=AA03(3,5);
            d=[AA03(3,1) fix(1000/AA03(3,2)) AA03(3,3) fix(1000/AA03(3,4))];
            w=liefeng1(M(1),cs,d,AA03(3,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(2,1) fix(1000/AA03(2,2)) AA03(2,3) fix(1000/AA03(2,4))];
            ww=liefeng1(M(1),cs,dd,AA03(2,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(2,3);
                 A1(1,4)=AA03(2,4);
                 A1(1,5)=AA03(2,5);
                 A1(1,6)=ww;
            end            
                        
        elseif A1(1,5)>AA03(3,5) && A1(1,5)<=AA03(4,5)
            A1(1,3)=AA03(4,3);
            A1(1,4)=AA03(4,4);
            A1(1,5)=AA03(4,5);
            d=[AA03(4,1) fix(1000/AA03(4,2)) AA03(4,3) fix(1000/AA03(4,4))];
            w=liefeng1(M(1),cs,d,AA03(4,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(3,1) fix(1000/AA03(3,2)) AA03(3,3) fix(1000/AA03(3,4))];
            ww=liefeng1(M(1),cs,dd,AA03(3,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(3,3);
                 A1(1,4)=AA03(3,4);
                 A1(1,5)=AA03(3,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA03(4,5) && A1(1,5)<=AA03(5,5)
            A1(1,3)=AA03(5,3);
            A1(1,4)=AA03(5,4);
            A1(1,5)=AA03(5,5);
            d=[AA03(5,1) fix(1000/AA03(5,2)) AA03(5,3) fix(1000/AA03(5,4))];
            w=liefeng1(M(1),cs,d,AA03(5,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(4,1) fix(1000/AA03(4,2)) AA03(4,3) fix(1000/AA03(4,4))];
            ww=liefeng1(M(1),cs,dd,AA03(4,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(4,3);
                 A1(1,4)=AA03(4,4);
                 A1(1,5)=AA03(4,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA03(5,5) && A1(1,5)<=AA03(6,5)
            A1(1,3)=AA03(6,3);
            A1(1,4)=AA03(6,4);
            A1(1,5)=AA03(6,5);
            d=[AA03(6,1) fix(1000/AA03(6,2)) AA03(6,3) fix(1000/AA03(6,4))];
            w=liefeng1(M(1),cs,d,AA03(6,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(5,1) fix(1000/AA03(5,2)) AA03(5,3) fix(1000/AA03(5,4))];
            ww=liefeng1(M(1),cs,dd,AA03(5,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(5,3);
                 A1(1,4)=AA03(5,4);
                 A1(1,5)=AA03(5,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA03(6,5) && A1(1,5)<=AA03(7,5)
            A1(1,3)=AA03(7,3);
            A1(1,4)=AA03(7,4);
            A1(1,5)=AA03(7,5);
            d=[AA03(7,1) fix(1000/AA03(7,2)) AA03(7,3) fix(1000/AA03(7,4))];
            w=liefeng1(M(1),cs,d,AA03(7,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(6,1) fix(1000/AA03(6,2)) AA03(6,3) fix(1000/AA03(6,4))];
            ww=liefeng1(M(1),cs,dd,AA03(6,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(6,3);
                 A1(1,4)=AA03(6,4);
                 A1(1,5)=AA03(6,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA03(7,5) && A1(1,5)<=AA03(8,5)
            A1(1,3)=AA03(8,3);
            A1(1,4)=AA03(8,4);
            A1(1,5)=AA03(8,5);
            d=[AA03(8,1) fix(1000/AA03(8,2)) AA03(8,3) fix(1000/AA03(8,4))];
            w=liefeng1(M(1),cs,d,AA03(8,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(7,1) fix(1000/AA03(7,2)) AA03(7,3) fix(1000/AA03(7,4))];
            ww=liefeng1(M(1),cs,dd,AA03(7,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(7,3);
                 A1(1,4)=AA03(7,4);
                 A1(1,5)=AA03(7,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA03(8,5) && A1(1,5)<=AA03(9,5)
            A1(1,3)=AA03(9,3);
            A1(1,4)=AA03(9,4);
            A1(1,5)=AA03(9,5);
            d=[AA03(9,1) fix(1000/AA03(9,2)) AA03(9,3) fix(1000/AA03(9,4))];
            w=liefeng1(M(1),cs,d,AA03(9,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(8,1) fix(1000/AA03(8,2)) AA03(8,3) fix(1000/AA03(8,4))];
            ww=liefeng1(M(1),cs,dd,AA03(8,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(8,3);
                 A1(1,4)=AA03(8,4);
                 A1(1,5)=AA03(8,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA03(9,5) && A1(1,5)<=AA03(10,5)
            A1(1,3)=AA03(10,3);
            A1(1,4)=AA03(10,4);
            A1(1,5)=AA03(10,5);
            d=[AA03(10,1) fix(1000/AA03(10,2)) AA03(10,3) fix(1000/AA03(10,4))];
            w=liefeng1(M(1),cs,d,AA03(10,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(9,1) fix(1000/AA03(9,2)) AA03(9,3) fix(1000/AA03(9,4))];
            ww=liefeng1(M(1),cs,dd,AA03(9,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(9,3);
                 A1(1,4)=AA03(9,4);
                 A1(1,5)=AA03(9,5);
                 A1(1,6)=ww;
            end            
                      
        elseif A1(1,5)>AA03(10,5) && A1(1,5)<=AA03(11,5)
            A1(1,3)=AA03(11,3);
            A1(1,4)=AA03(11,4);
            A1(1,5)=AA03(11,5);
            d=[AA03(11,1) fix(1000/AA03(11,2)) AA03(11,3) fix(1000/AA03(11,4))];
            w=liefeng1(M(1),cs,d,AA03(11,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA03(10,1) fix(1000/AA03(10,2)) AA03(10,3) fix(1000/AA03(10,4))];
            ww=liefeng1(M(1),cs,dd,AA03(10,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA03(10,3);
                 A1(1,4)=AA03(10,4);
                 A1(1,5)=AA03(10,5);
                 A1(1,6)=ww;
            end               
        end             
   A=A1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%        
   elseif A1(2,1)==18
        if A1(1,5)<=AA04(2,5)
            A1(1,3)=AA04(2,3);
            A1(1,4)=AA04(2,4);
            A1(1,5)=AA04(2,5);
            d=[AA04(2,1) fix(1000/AA04(2,2)) AA04(2,3) fix(1000/AA04(2,4))];
            w=liefeng1(M(1),cs,d,AA04(2,5),h(1),C,rg); 
            A1(1,6)=w;           
             
        elseif A1(1,5)>AA04(2,5) && A1(1,5)<=AA04(3,5)
            A1(1,3)=AA04(3,3);
            A1(1,4)=AA04(3,4);
            A1(1,5)=AA04(3,5);
            d=[AA04(3,1) fix(1000/AA04(3,2)) AA04(3,3) fix(1000/AA04(3,4))];
            w=liefeng1(M(1),cs,d,AA04(3,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(2,1) fix(1000/AA04(2,2)) AA04(2,3) fix(1000/AA04(2,4))];
            ww=liefeng1(M(1),cs,dd,AA04(2,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(2,3);
                 A1(1,4)=AA04(2,4);
                 A1(1,5)=AA04(2,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA04(3,5) && A1(1,5)<=AA04(4,5)
            A1(1,3)=AA04(4,3);
            A1(1,4)=AA04(4,4);
            A1(1,5)=AA04(4,5);
            d=[AA04(4,1) fix(1000/AA04(4,2)) AA04(4,3) fix(1000/AA04(4,4))];
            w=liefeng1(M(1),cs,d,AA04(4,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(3,1) fix(1000/AA04(3,2)) AA04(3,3) fix(1000/AA04(3,4))];
            ww=liefeng1(M(1),cs,dd,AA04(3,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(3,3);
                 A1(1,4)=AA04(3,4);
                 A1(1,5)=AA04(3,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA04(4,5) && A1(1,5)<=AA04(5,5)
            A1(1,3)=AA04(5,3);
            A1(1,4)=AA04(5,4);
            A1(1,5)=AA04(5,5);
            d=[AA04(5,1) fix(1000/AA04(5,2)) AA04(5,3) fix(1000/AA04(5,4))];
            w=liefeng1(M(1),cs,d,AA04(5,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(4,1) fix(1000/AA04(4,2)) AA04(4,3) fix(1000/AA04(4,4))];
            ww=liefeng1(M(1),cs,dd,AA04(4,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(4,3);
                 A1(1,4)=AA04(4,4);
                 A1(1,5)=AA04(4,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA04(5,5) && A1(1,5)<=AA04(6,5)
            A1(1,3)=AA04(6,3);
            A1(1,4)=AA04(6,4);
            A1(1,5)=AA04(6,5);
            d=[AA04(6,1) fix(1000/AA04(6,2)) AA04(6,3) fix(1000/AA04(6,4))];
            w=liefeng1(M(1),cs,d,AA04(6,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(5,1) fix(1000/AA04(5,2)) AA04(5,3) fix(1000/AA04(5,4))];
            ww=liefeng1(M(1),cs,dd,AA04(5,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(5,3);
                 A1(1,4)=AA04(5,4);
                 A1(1,5)=AA04(5,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA04(6,5) && A1(1,5)<=AA04(7,5)
            A1(1,3)=AA04(7,3);
            A1(1,4)=AA04(7,4);
            A1(1,5)=AA04(7,5);
            d=[AA04(7,1) fix(1000/AA04(7,2)) AA04(7,3) fix(1000/AA04(7,4))];
            w=liefeng1(M(1),cs,d,AA04(7,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(6,1) fix(1000/AA04(6,2)) AA04(6,3) fix(1000/AA04(6,4))];
            ww=liefeng1(M(1),cs,dd,AA04(6,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(6,3);
                 A1(1,4)=AA04(6,4);
                 A1(1,5)=AA04(6,5);
                 A1(1,6)=ww;
            end              
            
        elseif A1(1,5)>AA04(7,5) && A1(1,5)<=AA04(8,5)
            A1(1,3)=AA04(8,3); 
            A1(1,4)=AA04(8,4); 
            A1(1,5)=AA04(8,5);
            d=[AA04(8,1) fix(1000/AA04(8,2)) AA04(8,3) fix(1000/AA04(8,4))];
            w=liefeng1(M(1),cs,d,AA04(8,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(7,1) fix(1000/AA04(7,2)) AA04(7,3) fix(1000/AA04(7,4))];
            ww=liefeng1(M(1),cs,dd,AA04(7,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(7,3);
                 A1(1,4)=AA04(7,4);
                 A1(1,5)=AA04(7,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA04(8,5) && A1(1,5)<=AA04(9,5)
            A1(1,3)=AA04(9,3);
            A1(1,4)=AA04(9,4);
            A1(1,5)=AA04(9,5);
            d=[AA04(9,1) fix(1000/AA04(9,2)) AA04(9,3) fix(1000/AA04(9,4))];
            w=liefeng1(M(1),cs,d,AA04(9,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(8,1) fix(1000/AA04(8,2)) AA04(8,3) fix(1000/AA04(8,4))];
            ww=liefeng1(M(1),cs,dd,AA04(8,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(8,3);
                 A1(1,4)=AA04(8,4);
                 A1(1,5)=AA04(8,5);
                 A1(1,6)=ww;
            end             
             
        elseif A1(1,5)>AA04(9,5) && A1(1,5)<=AA04(10,5)
            A1(1,3)=AA04(10,3);
            A1(1,4)=AA04(10,4);
            A1(1,5)=AA04(10,5);
            d=[AA04(10,1) fix(1000/AA04(10,2)) AA04(10,3) fix(1000/AA04(10,4))];
            w=liefeng1(M(1),cs,d,AA04(10,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(9,1) fix(1000/AA04(9,2)) AA04(9,3) fix(1000/AA04(9,4))];
            ww=liefeng1(M(1),cs,dd,AA04(9,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(9,3);
                 A1(1,4)=AA04(9,4);
                 A1(1,5)=AA04(9,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA04(10,5) && A1(1,5)<=AA04(11,5)
            A1(1,3)=AA04(11,3);
            A1(1,4)=AA04(11,4);
            A1(1,5)=AA04(11,5);
            d=[AA04(11,1) fix(1000/AA04(11,2)) AA04(11,3) fix(1000/AA04(11,4))];
            w=liefeng1(M(1),cs,d,AA04(11,5),h(1),C,rg); 
            A1(1,6)=w;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA04(10,1) fix(1000/AA04(10,2)) AA04(10,3) fix(1000/AA04(10,4))];
            ww=liefeng1(M(1),cs,dd,AA04(10,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA04(10,3);
                 A1(1,4)=AA04(10,4);
                 A1(1,5)=AA04(10,5);
                 A1(1,6)=ww;
            end                      
        end              
    A=A1;
 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%               
        elseif A1(2,1)==20
        if A1(1,5)<=AA05(2,5)
            A1(1,3)=AA05(2,3);
            A1(1,4)=AA05(2,4);
            A1(1,5)=AA05(2,5);
            d=[AA05(2,1) fix(1000/AA05(2,2)) AA05(2,3) fix(1000/AA05(2,4))];
            w=liefeng1(M(1),cs,d,AA05(2,5),h(1),C,rg); 
            A1(1,6)=w;            
         
        elseif A1(1,5)>AA05(2,5) && A1(1,5)<=AA05(3,5)
            A1(1,3)=AA05(3,3);
            A1(1,4)=AA05(3,4);
            A1(1,5)=AA05(3,5);
            d=[AA05(3,1) fix(1000/AA05(3,2)) AA05(3,3) fix(1000/AA05(3,4))];
            w=liefeng1(M(1),cs,d,AA05(3,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(2,1) fix(1000/AA05(2,2)) AA05(2,3) fix(1000/AA05(2,4))];
            ww=liefeng1(M(1),cs,dd,AA05(2,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(2,3);
                 A1(1,4)=AA05(2,4);
                 A1(1,5)=AA05(2,5);
                 A1(1,6)=ww;
            end              
            
        elseif A1(1,5)>AA05(3,5) && A1(1,5)<=AA05(4,5)
            A1(1,3)=AA05(4,3);
            A1(1,4)=AA05(4,4);
            A1(1,5)=AA05(4,5);
            d=[AA05(4,1) fix(1000/AA05(4,2)) AA05(4,3) fix(1000/AA05(4,4))];
            w=liefeng1(M(1),cs,d,AA05(4,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(3,1) fix(1000/AA05(3,2)) AA05(3,3) fix(1000/AA05(3,4))];
            ww=liefeng1(M(1),cs,dd,AA05(3,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(3,3);
                 A1(1,4)=AA05(3,4);
                 A1(1,5)=AA05(3,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA05(4,5) && A1(1,5)<=AA05(5,5)
            A1(1,3)=AA05(5,3); 
            A1(1,4)=AA05(5,4); 
            A1(1,5)=AA05(5,5);
            d=[AA05(5,1) fix(1000/AA05(5,2)) AA05(5,3) fix(1000/AA05(5,4))];
            w=liefeng1(M(1),cs,d,AA05(5,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(4,1) fix(1000/AA05(4,2)) AA05(4,3) fix(1000/AA05(4,4))];
            ww=liefeng1(M(1),cs,dd,AA05(4,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(4,3);
                 A1(1,4)=AA05(4,4);
                 A1(1,5)=AA05(4,5);
                 A1(1,6)=ww;
            end
            
        elseif A1(1,5)>AA05(5,5) && A1(1,5)<=AA05(6,5)
            A1(1,3)=AA05(6,3);
            A1(1,4)=AA05(6,4);
            A1(1,5)=AA05(6,5);
            d=[AA05(6,1) fix(1000/AA05(6,2)) AA05(6,3) fix(1000/AA05(6,4))];
            w=liefeng1(M(1),cs,d,AA05(6,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(5,1) fix(1000/AA05(5,2)) AA05(5,3) fix(1000/AA05(5,4))];
            ww=liefeng1(M(1),cs,dd,AA05(5,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(5,3);
                 A1(1,4)=AA05(5,4);
                 A1(1,5)=AA05(5,5);
                 A1(1,6)=ww;
            end            
                    
        elseif A1(1,5)>AA05(6,5) && A1(1,5)<=AA05(7,5)
            A1(1,3)=AA05(7,3);
            A1(1,4)=AA05(7,4);
            A1(1,5)=AA05(7,5);
            d=[AA05(7,1) fix(1000/AA05(7,2)) AA05(7,3) fix(1000/AA05(7,4))];
            w=liefeng1(M(1),cs,d,AA05(7,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(6,1) fix(1000/AA05(6,2)) AA05(6,3) fix(1000/AA05(6,4))];
            ww=liefeng1(M(1),cs,dd,AA05(6,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(6,3);
                 A1(1,4)=AA05(6,4);
                 A1(1,5)=AA05(6,5);
                 A1(1,6)=ww;
            end             
                        
        elseif A1(1,5)>AA05(7,5) && A1(1,5)<=AA05(8,5)
            A1(1,3)=AA05(8,3);
            A1(1,4)=AA05(8,4);
            A1(1,5)=AA05(8,5);
            d=[AA05(8,1) fix(1000/AA05(8,2)) AA05(8,3) fix(1000/AA05(8,4))];
            w=liefeng1(M(1),cs,d,AA05(8,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(7,1) fix(1000/AA05(7,2)) AA05(7,3) fix(1000/AA05(7,4))];
            ww=liefeng1(M(1),cs,dd,AA05(7,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(7,3);
                 A1(1,4)=AA05(7,4);
                 A1(1,5)=AA05(7,5);
                 A1(1,6)=ww;
            end             
                     
        elseif A1(1,5)>AA05(8,5) && A1(1,5)<=AA05(9,5)
            A1(1,3)=AA05(9,3); 
            A1(1,4)=AA05(9,4);
            A1(1,5)=AA05(9,5);
            d=[AA05(9,1) fix(1000/AA05(9,2)) AA05(9,3) fix(1000/AA05(9,4))];
            w=liefeng1(M(1),cs,d,AA05(9,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(8,1) fix(1000/AA05(8,2)) AA05(8,3) fix(1000/AA05(8,4))];
            ww=liefeng1(M(1),cs,dd,AA05(8,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(8,3);
                 A1(1,4)=AA05(8,4);
                 A1(1,5)=AA05(8,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA05(9,5) && A1(1,5)<=AA05(10,5)
            A1(1,3)=AA05(10,3); 
            A1(1,4)=AA05(10,4);
            A1(1,5)=AA05(10,5);
            d=[AA05(10,1) fix(1000/AA05(10,2)) AA05(10,3) fix(1000/AA05(10,4))];
            w=liefeng1(M(1),cs,d,AA05(10,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(9,1) fix(1000/AA05(9,2)) AA05(9,3) fix(1000/AA05(9,4))];
            ww=liefeng1(M(1),cs,dd,AA05(9,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(9,3);
                 A1(1,4)=AA05(9,4);
                 A1(1,5)=AA05(9,5);
                 A1(1,6)=ww;
            end            
                        
        elseif A1(1,5)>AA05(10,5) && A1(1,5)<=AA05(11,5)
            A1(1,3)=AA05(11,3);
            A1(1,4)=AA05(11,4);
            A1(1,5)=AA05(11,5);
            d=[AA05(11,1) fix(1000/AA05(11,2)) AA05(11,3) fix(1000/AA05(11,4))];
            w=liefeng1(M(1),cs,d,AA05(11,5),h(1),C,rg); 
            A1(1,6)=w;             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA05(10,1) fix(1000/AA05(10,2)) AA05(10,3) fix(1000/AA05(10,4))];
            ww=liefeng1(M(1),cs,dd,AA05(10,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA05(10,3);
                 A1(1,4)=AA05(10,4);
                 A1(1,5)=AA05(10,5);
                 A1(1,6)=ww;
            end                        
        end              
    A=A1;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%    
    elseif A1(2,1)==22
        if A1(1,5)<=AA06(2,5)
            A1(1,3)=AA06(2,3);
            A1(1,4)=AA06(2,4);
            A1(1,5)=AA06(2,5);
            d=[AA06(2,1) fix(1000/AA06(2,2)) AA06(2,3) fix(1000/AA06(2,4))];
            w=liefeng1(M(1),cs,d,AA06(2,5),h(1),C,rg); 
            A1(1,6)=w;             
            
        elseif A1(1,5)>AA06(2,5) && A1(1,5)<=AA06(3,5)
            A1(1,3)=AA06(3,3);
            A1(1,4)=AA06(3,4);
            A1(1,5)=AA06(3,5);
            d=[AA06(3,1) fix(1000/AA06(3,2)) AA06(3,3) fix(1000/AA06(3,4))];
            w=liefeng1(M(1),cs,d,AA06(3,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(2,1) fix(1000/AA06(2,2)) AA06(2,3) fix(1000/AA06(2,4))];
            ww=liefeng1(M(1),cs,dd,AA06(2,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA06(2,3);
                 A1(1,4)=AA06(2,4);
                 A1(1,5)=AA06(2,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA06(3,5) && A1(1,5)<=AA06(4,5)
            A1(1,3)=AA06(4,3);
            A1(1,4)=AA06(4,4);
            A1(1,5)=AA06(4,5);
            d=[AA06(4,1) fix(1000/AA06(4,2)) AA06(4,3) fix(1000/AA06(4,4))];
            w=liefeng1(M(1),cs,d,AA06(4,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(3,1) fix(1000/AA06(3,2)) AA06(3,3) fix(1000/AA06(3,4))];
            ww=liefeng1(M(1),cs,dd,AA06(3,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA06(3,3);
                 A1(1,4)=AA06(3,4);
                 A1(1,5)=AA06(3,5);
                 A1(1,6)=ww;
            end             
                       
        elseif A1(1,5)>AA06(4,5) && A1(1,5)<=AA06(5,5)
            A1(1,3)=AA06(5,3);
            A1(1,4)=AA06(5,4);
            A1(1,5)=AA06(5,5);
            d=[AA06(5,1) fix(1000/AA06(5,2)) AA06(5,3) fix(1000/AA06(5,4))];
            w=liefeng1(M(1),cs,d,AA06(5,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(4,1) fix(1000/AA06(4,2)) AA06(4,3) fix(1000/AA06(4,4))];
            ww=liefeng1(M(1),cs,dd,AA06(4,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA06(4,3);
                 A1(1,4)=AA06(4,4);
                 A1(1,5)=AA06(4,5);
                 A1(1,6)=ww;
            end            
                        
        elseif A1(1,5)>AA06(5,5) && A1(1,5)<=AA06(6,5)
            A1(1,3)=AA06(6,3);
            A1(1,4)=AA06(6,4);
            A1(1,5)=AA06(6,5);
            d=[AA06(6,1) fix(1000/AA06(6,2)) AA06(6,3) fix(1000/AA06(6,4))];
            w=liefeng1(M(1),cs,d,AA06(6,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(5,1) fix(1000/AA06(5,2)) AA06(5,3) fix(1000/AA06(5,4))];
            ww=liefeng1(M(1),cs,dd,AA06(5,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA06(5,3);
                 A1(1,4)=AA06(5,4);
                 A1(1,5)=AA06(5,5);
                 A1(1,6)=ww;
            end            
                       
        elseif A1(1,5)>AA06(6,5) && A1(1,5)<=AA06(7,5)
            A1(1,3)=AA06(7,3);
            A1(1,4)=AA06(7,4);
            A1(1,5)=AA06(7,5);
            d=[AA06(7,1) fix(1000/AA06(7,2)) AA06(7,3) fix(1000/AA06(7,4))];
            w=liefeng1(M(1),cs,d,AA06(7,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(6,1) fix(1000/AA06(6,2)) AA06(6,3) fix(1000/AA06(6,4))];
            ww=liefeng1(M(1),cs,dd,AA06(6,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA06(6,3);
                 A1(1,4)=AA06(6,4);
                 A1(1,5)=AA06(6,5);
                 A1(1,6)=ww;
            end             
                     
        elseif A1(1,5)>AA06(7,5) && A1(1,5)<=AA06(8,5)
            A1(1,3)=AA06(8,3);
            A1(1,4)=AA06(8,4);
            A1(1,5)=AA06(8,5);
            d=[AA06(8,1) fix(1000/AA06(8,2)) AA06(8,3) fix(1000/AA06(8,4))];
            w=liefeng1(M(1),cs,d,AA06(8,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(7,1) fix(1000/AA06(7,2)) AA06(7,3) fix(1000/AA06(7,4))];
            ww=liefeng1(M(1),cs,dd,AA06(7,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA06(7,3);
                 A1(1,4)=AA06(7,4);
                 A1(1,5)=AA06(7,5);
                 A1(1,6)=ww;
            end            
                      
        elseif A1(1,5)>AA06(8,5) && A1(1,5)<=AA06(9,5)
            A1(1,3)=AA06(9,3);
            A1(1,4)=AA06(9,4);
            A1(1,5)=AA06(9,5);
            d=[AA06(9,1) fix(1000/AA06(9,2)) AA06(9,3) fix(1000/AA06(9,4))];
            w=liefeng1(M(1),cs,d,AA06(9,5),h(1),C,rg); 
            A1(1,6)=w;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA06(8,1) fix(1000/AA06(8,2)) AA06(8,3) fix(1000/AA06(8,4))];
            ww=liefeng1(M(1),cs,dd,AA06(8,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA06(8,3);
                 A1(1,4)=AA06(8,4);
                 A1(1,5)=AA06(8,5);
                 A1(1,6)=ww;
            end                    
        end            
    A=A1;            
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%   
    elseif A1(2,1)==25
        if A1(1,5)<=AA07(2,5)
            A1(1,3)=AA07(2,3);
            A1(1,4)=AA07(2,4);
            A1(1,5)=AA07(2,5);
            d=[AA07(2,1) fix(1000/AA07(2,2)) AA07(2,3) fix(1000/AA07(2,4))];
            w=liefeng1(M(1),cs,d,AA07(2,5),h(1),C,rg); 
            A1(1,6)=w;              
                   
        elseif A1(1,5)>AA07(2,5) && A1(1,5)<=AA07(3,5)
            A1(1,3)=AA07(3,3);
            A1(1,4)=AA07(3,4);
            A1(1,5)=AA07(3,5);
            d=[AA07(3,1) fix(1000/AA07(3,2)) AA07(3,3) fix(1000/AA07(3,4))];
            w=liefeng1(M(1),cs,d,AA07(3,5),h(1),C,rg); 
            A1(1,6)=w;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(2,1) fix(1000/AA07(2,2)) AA07(2,3) fix(1000/AA07(2,4))];
            ww=liefeng1(M(1),cs,dd,AA07(2,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA07(2,3);
                 A1(1,4)=AA07(2,4);
                 A1(1,5)=AA07(2,5);
                 A1(1,6)=ww;
            end             
                        
        elseif A1(1,5)>AA07(3,5) && A1(1,5)<=AA07(4,5)
            A1(1,3)=AA07(4,3);
            A1(1,4)=AA07(4,4);
            A1(1,5)=AA07(4,5);
            d=[AA07(4,1) fix(1000/AA07(4,2)) AA07(4,3) fix(1000/AA07(4,4))];
            w=liefeng1(M(1),cs,d,AA07(4,5),h(1),C,rg); 
            A1(1,6)=w;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(3,1) fix(1000/AA07(3,2)) AA07(3,3) fix(1000/AA07(3,4))];
            ww=liefeng1(M(1),cs,dd,AA07(3,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA07(3,3);
                 A1(1,4)=AA07(3,4);
                 A1(1,5)=AA07(3,5);
                 A1(1,6)=ww;
            end             
                        
        elseif A1(1,5)>AA07(4,5) && A1(1,5)<=AA07(5,5)
            A1(1,3)=AA07(5,3);
            A1(1,4)=AA07(5,4);
            A1(1,5)=AA07(5,5);
            d=[AA07(5,1) fix(1000/AA07(5,2)) AA07(5,3) fix(1000/AA07(5,4))];
            w=liefeng1(M(1),cs,d,AA07(5,5),h(1),C,rg); 
            A1(1,6)=w;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(4,1) fix(1000/AA07(4,2)) AA07(4,3) fix(1000/AA07(4,4))];
            ww=liefeng1(M(1),cs,dd,AA07(4,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA07(4,3);
                 A1(1,4)=AA07(4,4);
                 A1(1,5)=AA07(4,5);
                 A1(1,6)=ww;
            end             
            
        elseif A1(1,5)>AA07(5,5) && A1(1,5)<=AA07(6,5)
            A1(1,3)=AA07(6,3); 
            A1(1,4)=AA07(6,4); 
            A1(1,5)=AA07(6,5);
            d=[AA07(6,1) fix(1000/AA07(6,2)) AA07(6,3) fix(1000/AA07(6,4))];
            w=liefeng1(M(1),cs,d,AA07(6,5),h(1),C,rg); 
            A1(1,6)=w;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(5,1) fix(1000/AA07(5,2)) AA07(5,3) fix(1000/AA07(5,4))];
            ww=liefeng1(M(1),cs,dd,AA07(5,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA07(5,3);
                 A1(1,4)=AA07(5,4);
                 A1(1,5)=AA07(5,5);
                 A1(1,6)=ww;
            end            
            
        elseif A1(1,5)>AA07(6,5) && A1(1,5)<=AA07(7,5)
            A1(1,3)=AA07(7,3); 
            A1(1,4)=AA07(7,4);
            A1(1,5)=AA07(7,5);
            d=[AA07(7,1) fix(1000/AA07(7,2)) AA07(7,3) fix(1000/AA07(7,4))];
            w=liefeng1(M(1),cs,d,AA07(7,5),h(1),C,rg); 
            A1(1,6)=w;           
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%若将配筋调低一档裂缝仍算得过，就将配筋降低一档，否则选筋不为最优解            
            dd=[AA07(6,1) fix(1000/AA07(6,2)) AA07(6,3) fix(1000/AA07(6,4))];
            ww=liefeng1(M(1),cs,dd,AA07(6,5),h(1),C,rg);                   %M（1）为A点的弯矩
            if ww<=0.2
                 A1(1,3)=AA07(6,3);
                 A1(1,4)=AA07(6,4);
                 A1(1,5)=AA07(6,5);
                 A1(1,6)=ww;
            end                
        end            
    A=A1;                  
    end      
end
end
